{"Manga's Name": "Miss Kobayashi's Dragon Maid: Lucoa Is My Xx", "Manga's cover Image": "https://avt.mkklcdnv6temp.com/22/b/18-1583497959.jpg", "Manga's author(s)": "Cool Kyoushinsha", "Manga's current status": "Ongoing", "Manga's genre(s)": "Ecchi - Seinen - Slice of life", "Manga's rating": null, "Manga's description": "A spin-off of Kobayashi-san Chi no Maid Dragon focusing on Shouta living with Lucoa as his familiar. ", "Manga's URL": "https://chap.manganelo.com/manga-ev118841", "Comments": ["nice", "I wonder when the other spin offs will get updated... I know there have been a bunch of updates on them too.", "So basically she's a shotacon right", "Well, a Shouta-con at least", "I see what you did,there.", "yo is this a doujin?", "it's an official spin off manga", "Make it into anime!", "I came here for progress", "Ngl I'm waiting for chichi chichi to update", "Fuck you bro like suck my dick you shit", "Respect for all that skilled people able to write comments with only one hand.", "hurry up and release chapter 26, and nobody gets hurt...#fatlucoa", "YO THE GUY BELOW ME IS BASED", "I SAVED UP SO MUCH CUM FOR THIS, TIME TO BLOW IT ALL", "Owshii rival of wet oniichan", "oh my first time see you", "Wet oniisan?", "i wonder what would the dragon king and the others do when they meet the eldritch gods", "This is how the dragonborn was made", "Hmmmm", "Where are the fbi memes huh? Fucking hypocrites", "boys and girls are different. let it go", "Joe Fixit Ahh.. fuck equality!", "Yoshikage Kira I mean, if a dude fucks multiple girls he is seen as a chad but if a women does it, she is seen as a slut...fuck equality!", "I came here for one reason and one reason only", "I came here for two....very big reasons", "Gender Inequality how delightful 😊", "Summary this manga in one word: \"Boobs\"", "They hadvhentai in mind when they made this", "Man i wish this manga was a hentai to see the lewd potential!", ".", "those some big bodonkers", "Lets be real here mangaka san Shouta is just shota without the 'u\"", "Wtf amına koyim ne la  bun animesn de şirin şirin takılıolardı aq mangaya bi girdim sikiş bu ne amk sinir oldum tamam mangada da  animede de bu kadın insanı azdırıoduda çocuk la arasında tuuhaf olaylardan hep bi cinsel gerilim bönüoduda dukadarı fazla pedofili lan bu", "beyin özürlü bu ana hikaye değil bu lucoa ve shota-kun'un beraber takılıp naptıklarını gösteriyo bu evrende bu klasik evren değilllll noob", "ayrıca ana hikayede de böyleler sadece söylenmiyoanime'nin hikayesini yazan kişi bu mangayı yaptı zaten", "ayrıca ayrıca eğer kadınlar yaparsa pedo olmuyolar \"shota\" oluyolar buda onlara suç değil zaten çocuğun adıda hentai katogorisinden geliyor", "Squeeze squeeze", "pure shit", "God damn it why cant I log in", "Same here. Fucek", "Same problem ,", "imagine if the gender where the opposite, and they did the exact same things", "what have you brought upon these cursed lands", "Ooga Booga Not wrong tho", "It looks like she is fucking him", "Lmao 😂 they get their own spinoff manga priceless", "Can we just drop the Lucoa/Shouta thing already? It was amusing at the start when she was originally trying to pay rent and resorted to \"concubine\" when everything else failed, but now it's been so done to death it just makes her look like an idiot.Most readers probably don't know anything about the character except the almost one-note \"adult trying to fuck a prepubescent boy\" that she was flanderized into.", "No....no we cant.", "I dont think you realize that was the author's intention all along. If you look over their other works, this sort of pairing is commonplace.", "This fucking author always has a little boy fetish.", "In japan woman as started to act like males. actually all around the world, thinking a young boy is innocent and cute so they can manipulate it to become a good lover.", "Nahim Hernandez please don't say \"all over the world\" LMFAO", "Maxwell FuseiniI'm from Brazil and this shit happens here too.From the other side of the fucking world from Japan.This is how far it has spreaded.", "It is coming! It is coming!", "Are we going to Jail a dragon???", "no", "she want that shota dick", "This is a story about Waver before he become Lord El Melloi II.", "This is hentai right ,RIGHT(´இ皿இ｀)", "Why did u use tamil??", "i wont watch the actually series since its yuri but ill read this spin off prepare your self shota she gonna turn you into a man why couldnt the series main mc be him instead", "you can read kyoushinsha's other series. needless to say there's alota shotas", "Fjdismoaf Elstroof naw im reading for the ship", "If that was yuri, it was the lightest fucking yuri I've ever seen."], "Images": ["https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/197046336_4002393963207428_237464946635698421_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=u9o_ftdRBEwAX8etJXv&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-hvTx_CpRDe1oUoXY-PAmooSuNSaEgcFs_5XzSi1wpcw&oe=62DB69F9", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/196049675_2899532426951301_1170995999995371213_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=SbHmbmWMjHoAX_EBw_o&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT912kQxGmEeT_gBXAG-xJoyAwr9-W2yQEyVDa9aYQOf-Q&oe=62DC2BAC", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/196889840_1185441721907475_3433969880993480248_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=DXm1azoMDvIAX_gqqKg&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-jEjbMADp6xzHjmJTTZ8fuJB6coTNrYT-i5XLLyBm8ew&oe=62DB8029", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/194916811_1702055756652734_4465491022734787075_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=dHWMVhf1vgwAX_J0NdO&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT99btpQvomUj9n1G5Wfb7_JE1ic2jDdxTk0hXVUy9yHTA&oe=62DC4F86"]}