{"0": {"Manga's Name": "Wolf’S Lies", "Manga's cover Image": "https://avt.mkklcdnv6temp.com/11/x/26-1655979080.jpg", "Manga's author(s)": "Jin Qiu", "Manga's current status": "Ongoing", "Manga's genre(s)": "Drama - Josei", "Manga rating": "3 / 5 - 1 votes", "Manga description": "In the flashy entertainment industry, drama and rumors explode on the daily, inciting public opinion. Behind the battle for public opinion, backstage players use sharp strategies to reverse and subvert situations. These players are called PR Crisis Agents! The female lead Zuo Bing is one of the best PR Agents in the world. During befuddling situations, she can always hunt down the lying “wolf” and reverse the situation. She’s gone through hundreds of these PR battles. But, on one fated PR battle, she met an opponent that toppled her from her throne… ", "Comments": ["firrsssttttt :::!!!!!!!!sorry no sorry try this lol its goooooooooooooooodhttps://mangashark.com/.../Kanan%25252Dsama-wa-Akumade...https://mangashark.com/.../Kanan%25252Dsama-wa-Akumade...https://mangashark.com/.../Kanan%25252Dsama-wa-Akumade..."], "Images": ["https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/289947795_5060333640729036_2626085741373465183_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=O-RBXTBaab4AX9rcmr4&_nc_oc=AQmkIqz_n04eYLv183qG7t9KF6BgxigmVQfYEYX-81flsjyHYEYFKHgXqyw9Gw1hIuw&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT8CddwVU2R_rI_9RYVDt4TT4IwfoJyl7hd_b6BI1onjsw&oe=62BA81E0"]}, "1": {"Manga's Name": "Martial Artist Lee Gwak", "Manga's cover Image": "https://avt.mkklcdnv6temp.com/21/m/25-1641312387.jpg", "Manga's author(s)": "Ugak (우각)", "Manga's current status": "Ongoing", "Manga's genre(s)": "Action - Adventure - Drama - Fantasy - Manhwa - Martial arts - Webtoons", "Manga rating": null, "Manga description": "Lee Gwak, an ordinary martial artist, was met with a terrible fate as he got involved with the celestial demon troupe and lost the ability to use any of his limbs.Just when he thought he had lost everything, A new hope dawned upon him. A martial arts that he once knew. He took his chances and put everything on the line by training in that martial arts and, by some miracle, is able to recover as he masters it.From then on, Lee Gwak aspires to live as a true martial artist and not as an ordinary martial artist like he once did before. ", "Comments": ["and hurt mee !https://mangashark.com/.../Kanan%25252Dsama-wa-Akumade...https://mangashark.com/.../Kanan%25252Dsama-wa-Akumade...its not its okeyy more i neeed morre !!!", "The next chapter 84 is out on earlymanga https://earlym.org/manga/martial-artist-lee-gwak/chapter-84The chapters are released much earlier on there  .", "How stupid I must have been to leave this wonderful manga website out! I must see it as much as possible to make up for it.: http://nt.geoagiphy.com/2260113", "He lives more like a fox than living as a wolf like he said he would...", "he will one day soar through the sky.", "i read the story and he is like wolf bruh just that he aint too playfull and is silent and observative", "The mc's face", "spoiler - The first girl will leave the MC for some other man because MC got paralyzed.", "FUCK I AM AN IDIOT I REARED SPOILER AND CONTINUED REARING", "I will read this other time after i forgor about this spoiler", "Plot wise this is a masterpiece but those who seeks op mc then you will have to wait because this has a really slow progress but the plot makes up for it. It's gold", "FINALLY, THEY STARTED UPLOADING AGAIN.", "tryy thiis onne ouut !!!https://mangashark.com/manga/Doomsday-Wonderland-raw-englishhttps://mangashark.com/manga/Doomsday-Wonderland-raw-english👩🏽‍🍳👨🏽‍🍳👨🏽‍🌾https://mangashark.com/manga/Doomsday-Wonderland-raw-englishhttps://mangashark.com/manga/Doomsday-Wonderland-raw-englishhttps://mangashark.com/manga/Doomsday-Wonderland-raw-englishhttps://mangashark.com/manga/Doomsday-Wonderland-raw-englishhttps://mangashark.com/manga/Doomsday-Wonderland-raw-english…See more", "Bruh I thought the title was martial artist Lee gawk.", "Is this good as infinite leveling murim?", "There's not even a comparison, this is waaaay better", "No", "id say they're equal", "Finally, the next chapter is coming tomorrow,", "Dam i was really looking forward to next chapter then i realized the last update a month ago", "RECOMMENDING MY FAVORITE:Since it was my first manhua, I didn't expect much. But I gave it a try, and I devoured 300+ chapters in a couple of days, and I'm hooked now. ** SPOILER ALERT ** In order to train his friends and exploit future events and secrets that other people are not aware of, he does. OPEN AND FREE FOR READING : http://mamga.abyssgiphy.com/sxwgm8", "This is actually really good, lot of weak people complaining about the pace tho", "Bro. It's been a month. -.-", "Top tier Manga,manhwa,manhua. New generation9/10Magic emperorReturn of the mount hua sectI am the fated villainAll hail the sect leaderThe return of the crazy demon Tales of demons and godsReincarnated as an aristocrat with an appraisal skill…See more", "U forgot to list murim login and overgeard, in 9/10", "You forgot MERCENARY ENROLLMENT", "No legend of the northern blade?", "Read up to 78. 6/10 its bang averageVery slow pace. A lot of characters are being introduced while the mc do nothing then after he got that new martial arts he its about mc getting stronger but you wont see the mc fight until chapter 40s.A lot of plot holes too.Art is awful.", "There are only a few chapters of this wonderful manga, but it's still good:: http://nt.hologiphy.com/223172", "Hiatus :(", "on the TL site they have this posted. A month to go.", "Really slow pace", "Is there a website with more chapters than this if so please link", "Me on 24th March :", "A lot of people hate on the MC for hiding his power saying that he would ''benefit'' more if he didn't. Yes, he would gain fame, wealth and responsibilities.But does our MC want that ? From what we seen he doesn't, he want to be at peace, to learn and grow stronger, to stay with the people he love and we seen on several occasions that he despise responsibilities. So yeah maybe you wouldn't hide your power but YOU aren't Lee Gwak", "The art is like Demon Fist of Mount Hua, so its really different from what you would usually see.MC is averagely strong but there aren't many fight scene to actually tell us how strong he actually is. Also he hides his strength.Tbh i still do like it despite that. 6/10", "I believe demon fist of mount hua happened in the past of this manwha, manhua", "I love this manhwa and the pace but the MC hiding his power like he his that powerful is just shit 💩💩💩", "Don't read this Talk no jutso 99.9%Fights 1%", "I mean I wouldn't trust someone who can't count", "a hidden diamond", "Well this is many time skip but the progress is very very slow. I understand why the MC hide his strength but the way he hide his strength too much is not totally good when he almost dont have anything. I mean hes poor, low rank, not enough connection, no master to teach him, sparring partner, no elixir/pills that will boost his strength, his weapon is above average, and with only low/mid rank martial arts. The only thing he have is the one martial arts from unknown master. Its better if he can find someone who will help him to become strong but those people who can help him is being treated like a normal friend. When his goal is to become as a strong of the strongest person here. Thats why this is very slow paced but well its still good.", "True", "Is this good?", "yes. unlike Op protagonist from the start and shows off, the protagonist in this manhwa is weak from the start and then slowy becomes stronger and also hiding his abilities for the sake of his friends and himself.", "people really hate mc for hiding his abilities huh? for an outer hall like him to learn strong martial arts is already too suspicious especially his main martial art that he got from so cheon that came from the library that is where strong martial arts books that is illegal to take from, a book that people in their right mind will never read since it requires you to throw away every martial arts you've learned which is most likely very suspicious that gwak learned it, they would become exetremely interested. so cheon would get severely punished if they found out that the book is gone, as long …See more", "I recommend another manga to anyone who likes this kind of stuff.: http://nt.hologiphy.com/ue93vx", "looking 👀 for new chapters of the good manhwa ✨ : Princess’ Dangerous Brotherstry this link 👉 👉 :https://www.mangaflam.com/manga/princess-dangerous-brothers/", "Bread🍞👍", "Didn't liked itSeems like no progressArt looks like a ghetto paper", "Damn, that's a lot of bots.", "The story building is also interesting seens it doesn't only focused on lee gwak they also give deep information about other members and characters so you don't need to be worried about getting bored and repeating against and again", "I like how his.........…See more", "Bruh this manhwa is so good! The story is so realistic they make the mc look weak and not to strong seens he doesn't have anyone to teach him the mc is not arrogant and not too kind! He's also hard working and there are many time jumps!", "Btw why did they mass released it? Is it because of slow release or something??", "For those who grew up reading ARES, this is by drawn by the same guy.His unique art style is back after years and while this is a martial arts manga, it’s more slice of life paced. Fucking missed this guy man, his unique art style and his story telling was so good back in the day.", "If only this was animated with the same art style", "Who tf is ares? And first of all what’s all the praise for this shitty art? Are there maybe something wrong with you eyes sir?", "Yonis Dahir don't speak you unrefined mortal you don't know what's art! Just stay away from us if you're just gonna complain about the art", "No wonder this series is so captivating. It's from the author of Legend of the northern blade.", "Seems to be developing a very good story but I can't tell because it's so freaking slow story.", "Read 50 chapters so far and he's still stuck in the same place from chapter 1 except now he's got martial arts but no one knows he has it.", "M surprised to see so many ppl complaining about the art and the plot as well . After coming across so many others , this a breath of fresh air . Art may seem ....... rough at times but man , if you look closely, some pages are SSS Tier ( so many wallpaper worthy) . To me , tis 9/10 .", "If you love characters like this, another manga will probably be your cup of tea: http://nt.hologiphy.com/esl8ry", "Art:6.0Story:7.5Character development:10 and 0 at the same time(because that mf mc doesn’t even reveal his power or climb higher, he stays at the lower part)It’s 70 chapters and there is no character development that shit is pissing me off", "[ USA ONLY ]My last pay check was $99000 Jobsing 12 hours a week online. My sisters friend has been averaging 15k for months now and she Jobss about 20 hours a week. I can't believe how easy it was once I tried it out. u can also do it by vising folowing websiite====)>) Www.Works96.Comℯ .Don,t incloud this >ك<when copy website.", "Wtf is the author thinking is he a fucking sadist holy fuck", "Thanks for saving my time", "try This Manhwa You will not regret 🔥Sauce:I Reincarnated As The Crazed Heirlink:https://www.mangaflam.com/.../i-reincarnated-as-the.../", "This is motivation Zyzz", "Op mc?", "Well i can say he is  moderately OP after 70 chapter i came up with conclusion he is kind of like person who fights in shadows , nobody in world know he is strong to some extent, i don't know but he rejected many chances to grow stronger. I don't know why he wants to stay at jade alliance even in the story he said that jaid alliance is the best place to grow when a shabby man from other unit invited him to join his unit promised him to give him high level pills and other benefits but it isn't explained why it is the best place and if its true then why he don't even try to get promoted from outer hall squard leader Story sure is a mess with slow pace", "I would like to introduce to everyone a recent hot mangaThat is: \"Legend of Star General\"Manga Link: https://mangas20.com/manga/legend-of-star-general/", "Why do authors with great stories have trsh artists? But the dirt authors with trsh stories get the best art?", "Bc good art is not something that applies to everything, sometimes a rough art set a better mood to the story, if you want an example look for fist demon of Mount Hua.", "What are you talking about the art is amazing closest art to ares till now", "Lol,His art style was and is iconic in the Korean comic world. It’s unique and rememberable rather then most “standard” good art but easily forgettable.", "Slow, but enjoyable", "Let's wait a month more.:In real life, the pain is real.. Could you please direct us to a site with more information?. Google led me to this: http://nt.geoagiphy.com/514ryi", "Does anybody know when itll pick up so i can come back when it does", "My Brain", "slow paced stories is so peaceful to read, can ease my mind", "slow paced stories like this is really good to read at night qiuet and peaceful", "by slow paced dont expect anything to happen with this least of chapters dumbass wait for another 50chapters and the war will heat up eventually... so far the slow paced story is good but im warning you.. yes you the impatient moron who doesnt know what slow paced stories are then fucked off", "I will say plot is nice but the pace is slow But be careful while watching it cuz its art can damage your meradian and even cripple you", "i say.. the art is good enough.. atleast its better than what i can draw", "Song Shuhang the art is not a problem only story i interested in this manhua I readed lot of manga have same art  like this  so I ain't know problem 😁", "it's somehow very boring but also very interesting. idk how they managed to do that but im constantly bored and invested at the same time", "Main character appearance reminds me of a friend from high school xd", "Damn so many bots here", "This one honestly isn’t worth reading. It’s been about 70 chapters, and a whole lot of nothing has happened. I mean, at the start, we have somewhat of a decent premise. MC is in of a bit of a rough situation and then endures a tragedy that puts him in an even tougher spot. Then he’s given the chance to rebuild himself and shine. Great. But after that’s established, nothing of importance happens. Sure the MC gets stronger, but he rarely does anything with that strength. In fact, most of the people around him don’t do anything either. It’s just a whole bunch of talking that amounts to nothing, l…See more", "This is a well thought out review, thank you. But I'm a dumbass and imma read it anyway.", "well that was slow paced all about", "I recommend this manga for you u should like it😍https://arcanemanga.org/.../Rebirth-of-the-Urban-Immortal...", "The same author has another completed manga named 'Ares'. That is one of the best mangas I have ever read.https://m.manganelo.com/manga-mh97575", "I don't know what writer is thinking but its been around 63 chapters and mc don't get to shine. He had only fought around 6 times in 63 chapters.the thing that makes me annoyed is that he had no goal set. Well plot is nice you can read it if you patience may be he will shine after next 50-60 chaters", "Its about plot, bot just a OP MC killed weak opponent.", "go on their website https://luminousscans.com/series/martial-artist-lee-gwak/", "may seem like an add, but i'd like to point everyone to a manga of the same author : Areshttps://manganato.com/manga-mh960364they mistranslated the author's name", "Start now making every month extra $15k or more by just doing an easy online job from home. Last month i have earned and received $16650 from this job by giving this only 2 hrs a a day.Every person can now get this job and start earning online by follow details in below website Open This⇁⇁http://SuperJoin829.surge.sh/", "Slow build up but it gets better overtime. I advise waiting till 100 chapters.", "Its refreshing to read manhwa with weak mc and their training", "𝐈 𝐟𝐫𝐞𝐞𝐥𝐚𝐧𝐜𝐞 𝐨𝐯𝐞𝐫 𝐭𝐡𝐞 𝐢𝐧𝐭𝐞𝐫𝐧𝐞𝐭 𝐚𝐧𝐝 𝐞𝐚𝐫𝐧 𝐚𝐛𝐨𝐮𝐭 𝟗𝟎-𝟗𝟓$ 𝐚𝐧 𝐡𝐨𝐮𝐫. 𝐈 𝐰𝐚𝐬 𝐰𝐢𝐭𝐡𝐨𝐮𝐭 𝐚 𝐣𝐨𝐛 𝐟𝐨𝐫 𝟔 𝐦𝐨𝐧𝐭𝐡𝐬 𝐛𝐮𝐭 𝐥𝐚𝐬𝐭 𝐦𝐨𝐧𝐭𝐡 𝐦𝐲 𝐩𝐚𝐲𝐜𝐡𝐞𝐜𝐤 𝐰𝐢𝐭𝐡 𝐛𝐢𝐠 𝐟𝐚𝐭 𝐛𝐨𝐧𝐮𝐬 𝐰𝐚𝐬 $𝟏𝟖𝟎𝟎𝟎 𝐣𝐮𝐬𝐭 𝐰𝐨𝐫𝐤𝐢𝐧𝐠 𝐨𝐧 𝐦𝐲 𝐜𝐨𝐦𝐩𝐮𝐭𝐞𝐫 𝐟𝐫𝐨𝐦 𝐦𝐲 𝐡𝐨𝐦𝐞 𝐟𝐨𝐫 𝟒-𝟓 𝐡𝐨𝐮𝐫𝐬. 𝐇𝐞𝐫𝐞'𝐬 𝐰𝐡𝐚𝐭 𝐢 𝐡𝐚𝐯𝐞 𝐛𝐞𝐞𝐧 𝐝𝐨𝐢𝐧𝐠.:)  GOOD LUCK.:)HERE ➤➤ W­­­w­­­w.F­­­o­­­x­­­o­­­f­­­f­­­i­­­c­­­i­­­a­­­l­­­1­­­­­­.C­o­mⓄ ●☚The Word→ Ⓞ ←is not with web address.", "This is also gonna be your type if you love this type of manhua: http://nt.hologiphy.com/s3lhfo", "Let's wait another month.:This is an actual pain.. Where can we find more information?. Google led me to this: http://nt.hologiphy.com/t93bhn", "chapter 64 fast updatehttps://readingmanga.org/.../martial-artist.../chapter-64/", "┉┉┉>>>> <(\") :p <3 :) (y) ;) :* <<<<┉┉┉I am making $95 bucks hours for telecommuting And in the event that you acknowledge that is cool, my segregated from companion has twin babies and made over $16k her first month. It feels so amazing getting a lot of money when others need to work for such fundamentally less. Legitimately and Earn additional cash in low help , I'm simply so joyful that I found a couple of arrangements concerning it..............====)>) Www.Works73.ComℛDo not copy \" ℛ \" with website", "Gwak! Gwak! Why I'm hearing Kronii's voice right now...", "I would say this is a decent manhwa, story is a little slow and art may be different but you'll get use to it. Personally I would rate this a 7.8/10", "Start now making every month extra $15k or more by just doing an easy online job from home. Last month i have earned and received $16650 from this job by giving this only 2 hrs a a day.Every person can now get this job and start earning online by follow details in below website Open This⇁⇁http://JoinWebs149.surge.sh/", "It's it's really slow, skip the first 9 chapts or skim read as they are basically a long unneeded prologue. It gets good froom their but don't expect many fights with the mc (the author always finds away to make it so they don't happen). It gets better the longer it goes on. I'd recommend reading it when it's got over 100 chapters since the story progresses so slow that you won't get to enjoy it for long when it finally starts ramping up. Overall, if you value your time and enjoymen, go somewhere else. This manga doesnt suck but it can be really infuriating and boring.", "don't do this. While the first 9 chapters can be pretty boring you need these chapters to understand later chapters and these chapters introduce many characters that are going to be important later. Also it is not as bad as this person says imo tho the war part can drag on. This manhwa is really good highly recommend.", "story is good but it is very slow and action is well ahhh not that much", "Hi everybodyI would like to introduce to everyone a super funny and action mangaThat is: \"Another Emperor Reborn - Different Kings\"Our Mangas20 website is the fastest place to update English translationsLink Manga: https://mangas20.com/manga/another-emperor-reborn/We invite you to visit our website to read stories to support us. Thanks", "The art looks very familiar anyone know the illustrator?", "art style gives off \"ares\" feels for me", "Nick Raule Yea I was thinking of anime called katanagatari. The eyes and over feel are the same from the designs.  Looks like a downgraded version of the art style. I do wish that type of art style was shown in anime more.", "Remove The \"Action\" Tag  i guess.", "another my favorite manga is worth all the praise as the best manga of all time.: http://nt.geoagiphy.com/vmkaiw", "Single mom now makes more than $600 per day simply doing Jobs online. i also made $18514 last month simply Jobsing online in my part time for 2 hrs a day. best way to makes extra cash online in spare time and this job is so easy just like copy and paste stuf. no need to sell anything just do Jobs and received dollars every month. go to this given website and follow instructions to start making dollars online right now.====)>) Www.Works96.Comℯ .Delete this symbol \"ℯ \" to open website.", "Lol The art style is like those stickman games in playstore", "The story is super good as expected from the author of the legend of the northern blade", "Start now making every month extra $15k or more by just doing an easy online job from home. Last month i have earned and received $16650 from this job by giving this only 2 hrs a a day.Every person can now get this job and start earning online by follow details in below website Open This⇁⇁http://JoinWebs99.surge.sh/", "This is a 5/5", "the summary make it feel like its \"the legend of the nothern blade\"", "I approb", "The heck I can hear it😂", "Hi everybodyCurrently Manhwa series \"The Boy of Death\" has been posted to Chapter 60 on different Websites, but we have translated to Chapter 130 and we will be posting 2 Chapters every day on Website Mangas20.Link: https://mangas20.com/manga/the-boy-of-death/Please visit the website to read stories to support us. Thanks", "Start now making every month extra $15k or more by just doing an easy online job from home. Last month i have earned and received $16650 from this job by giving this only 2 hrs a a day.Every person can now get this job and start earning online by follow details in below website Open This⇁⇁http://BuzzNews770.surge.sh/", "Guys, please read this at luminousscans.com, they are officially translating it and it's daily release", "art was a bait this is so good", "Pity for anyone who dropped this because they thought the art was bad", "If you want to Read the best manhwa try This ❤️ 🔥 🔥 https://scansnelo.com/.../the-constellation-that.../", "pretty good", "he was a martial artist ...... but fate turned him into a martial artist", "Wut?", "Summary", "you guys must read this asap: http://nt.hologiphy.com/lkqa9f", "Seems fun", "Good stuff, art is nice as hell, story is pretty nice, slow burn, not suitable for who prefers op mc in just a few chapters, 9/10", "ugh this is good hope more gets released", "I haven't read this but the author is the same author who create Legend of The Northern Blade,Memoir Of The King Of War,Fist Demon of Mount Hua.", "Gonna read now that I know, thanks. Love Hae-Mins' works so far.", "daily release and currently more chapters at https://luminousscans.com/series/martial-artist-lee-gwak/", "Wow, first time all the ntr comments are real.", "i'm pretty sure it's the same author as this mangahttps://manganato.com/manga-mh960364they just messed up the translation of the author's name. The art style is just way too similar", "The early chapters are is like a backstory for mc and after he get crippled there where the story starts(around 20) and for new readers sake don't ship mc with pipa girl", "Good shit, murim manhwa kicks some serious ass.", "𝐈 𝐟𝐫𝐞𝐞𝐥𝐚𝐧𝐜𝐞 𝐨𝐯𝐞𝐫 𝐭𝐡𝐞 𝐢𝐧𝐭𝐞𝐫𝐧𝐞𝐭 𝐚𝐧𝐝 𝐞𝐚𝐫𝐧 𝐚𝐛𝐨𝐮𝐭 𝟗𝟎-𝟗𝟓$ 𝐚𝐧 𝐡𝐨𝐮𝐫. 𝐈 𝐰𝐚𝐬 𝐰𝐢𝐭𝐡𝐨𝐮𝐭 𝐚 𝐣𝐨𝐛 𝐟𝐨𝐫 𝟔 𝐦𝐨𝐧𝐭𝐡𝐬 𝐛𝐮𝐭 𝐥𝐚𝐬𝐭 𝐦𝐨𝐧𝐭𝐡 𝐦𝐲 𝐩𝐚𝐲𝐜𝐡𝐞𝐜𝐤 𝐰𝐢𝐭𝐡 𝐛𝐢𝐠 𝐟𝐚𝐭 𝐛𝐨𝐧𝐮𝐬 𝐰𝐚𝐬 $𝟏𝟖𝟎𝟎𝟎 𝐣𝐮𝐬𝐭 𝐰𝐨𝐫𝐤𝐢𝐧𝐠 𝐨𝐧 𝐦𝐲 𝐜𝐨𝐦𝐩𝐮𝐭𝐞𝐫 𝐟𝐫𝐨𝐦 𝐦𝐲 𝐡𝐨𝐦𝐞 𝐟𝐨𝐫 𝟒-𝟓 𝐡𝐨𝐮𝐫𝐬. 𝐇𝐞𝐫𝐞'𝐬 𝐰𝐡𝐚𝐭 𝐢 𝐡𝐚𝐯𝐞 𝐛𝐞𝐞𝐧 𝐝𝐨𝐢𝐧𝐠.:)  GOOD LUCK.:)HERE ➤➤ W­­­w­­­w.F­­­o­­­x­­­o­­­f­­­f­­­i­­­c­­­i­­­a­­­l­­­1­­­­­­.C­o­mⓄ ●☚The Word→ Ⓞ ←is not with web address.", "art 8/10story 7/10", "This is cool, his interractions with all the girls are so funny. I liked that he started from the bottom and slightly getting stronger all by himself, though I kinda dislike that he is hiding his skills. The art is unique that you just need to get used to it but I really like it, and you might get bored since the pacing has a lot of build-up and nothing major really is going on but prolly because this is one of those long series that you need to wait for atleast a hundred chapter before you binged read it.", "chapter 16 fast updatehttps://readingmanga.org/.../martial-artist.../chapter-60/", "Can anyone spoil me about what happened to that love interest? Cause I kinda  don't want her to be the FMC, is she and the MC meet or something?", "pretty heavy spoilers, the instrament girl goes ntr, his little sister style character seems to be the main waifu atm, with a few geniuses on the side", "it takes like ten chapters for it to get going, but after that it suddenelly ended, and I noticed the dreaded lack of a next chapter...", "To be honest, it's never a good sign when the MC already have a love interest from the first chapter. Something will always happened. Worse is he got NTR, slight worst is the love interest got killed.", "na fam died love intret means mc is cold but caring and aggressive in that topic NTR means mc with i had enough vibe but seriously ntr is the worse when mc is innocent", "8/10", "It's like one punch man, MC is a strong not known master and also has less fight screen time but the story is very good it's well presented 9/10", "For those of you that are on the fence about whether to read it or not, the author of this manhwa, Ugak, is the same one who wrote Fist Demon of Mount Hua. This manhwa even takes places in the same universe just later in the future. The artist is not the same as Fist Demon of Mount Hua, but the author is.", "8/10", "9/10", "trash", "Wrong", "I ­­­­am ­­­­making 85 b­­­­ucks each hour ­­­­for working ­­­­online. I never ­­­­thought ­­­­that ­­­­it ­­­­was ­­­­legit but­­­­ my ­­­­best­­­­ friend earns ­­­­11000 dollars ­­­­every month d­­­­oing this and she ­­­­showed me how. Check it out by ­­­­visiting followin ­­­­link.check it… w­w­w­.­­f­­o­­x­­o­­f­­f­­i­­c­­i­­a­­l­­1­­­­.­c­o­mᴵᴵᴵᴵᴵᴵᴵᴵᴵᴵ", "I will give you 100 bucks for an hour. Come over.", "the art is.. Samurai Jack ish?", "If you wanted to read this just read and don't listen to Mark Gee..", "Yeah it's good, but people talking about build up? at one point it feels like there is no build up for excitment rather for boredom instead, and that makes up a good amount of the story so far.Excluding that, there are definitly hype inducing parts of the story, which is a definite good.Overall I guess read it, it's better then continuing on searching for other inconsistent/bad flowing stories.", "Art is sh*t but story is good and mc learned yoga Martial arts", "Wait, yoga is martial art now ?", "Maël Bazin don't know 🙂", "Maël Bazin he corrected the name to 8 snakes martial techniques or smth", "look personally the art was really weird but itll grow on you. read it. its really good", "my takeaway from the comments is dont listen to mark gee", "yes mark gee is gae", "Unironically one of the best \"Martial arts type\" manwha, I wouldnt call it cuultivating at all. It has build up, the characters are well written, nothing too generic and the protag feels like a person.One of the worst things a Writer can do is tell the readers straight up the powerlevel of a person, which many cultivation and Martial arts manwhas commit (example: low earth level 1 power or sth) which this manwha doesnt haveAlso the people feel believable and real, people that go against the mc arent always presented as agnorant and straightup dumb and the girls dont instantly fall in love w…See more", "Man i cought up too fast", "Start now making every month extra $15k or more by just doing an easy online job from home. Last month i have earned and received $16650 from this job by giving this only 2 hrs a a day.Every person can now get this job and start earning online by follow details in below websiteOpen This⇁⇁http://OnlineHelp32.surge.sh/", "DONT READ THIS I SAW SOME RETARD POST A SPAMCOMMENT SO I HAVE TO DO THIS 😞if you read this comment yourparents will die within 0 years(cuz they'realready dead and ur a fucking orphan). toundo the curse you have to succ my cock andeat nothing but shit and cum for 3 days andjump off a cliff until you die 100000x and afterthat get reincarnated into the world of goblin slayeras a helpless female villager and die a slow painful…See more", "Fuck you", "Karl Ferrer Are you alright? Did anybody hurt you? If you are, then fuck you lol nobody cares", "im sorry but,,,, Lee", "Yall in enjoying the stickman art?", "Dear side characters.  Be careful", "10/10, the art may be bothering you from the beginning, but you'll get used to it. Don't listen to Mark Gee below, he's just a newbie", "Yea FR such dumb*ss nuub", "I pity you, you must've been through a lot of pain and suffering. Turning off your brain while reading or maybe you didn't even have one,", "I haven't read it... but someone commented in the comments that it has politics and romance, meaning I think this manhwa will have a 'story' not just a 'plot'... although someone say this slow build, i think it is better than a manhwa that is only leveling up, killing enemy then problem solved...So i think i will give it a tries until the lastest chapter... Remember gintama? For me at first gintama is really weird anime and boring, but it turns into a great anime after a lot of episode!!", "Atleast gintama is funny and the characters are well written not like this manhwa generic piece", "Mark Gee even sonic couldn't find who asked", "Manweel Esho who again?", "This is pretty good! Plz don’t listen to Mark gee, Mark gee is pretty he sound like never a manga with a good build ups.", "Wow amazing, check out my MAL: https://myanimelist.net/mangalist/A--bomb&view=tile&status=2", "You don't even know how to rate and identify what a \"good build ups\" means", "Mark Gee We have different tastes. That statement implies that YOU understand how to rate a series, correct? But you're already disgusted because there's romance in the story, now you say that you know how to rate a series? Now you're rating it lower because the artwork was poor? Is this your first time seeing this type of art? Is the plot slow and monotonous? What do you expect from a murim manhwa? Is this your first time reading this plot? You don't even know how to properly rate a story, so stfu.", "The only thing I don't like here is the art...", "Im making over $14k a month Jobsing part time. I kept hearing other people tell me how much money they can make online so I decided to look into it. Well, it was all true and has totally changed my life. my last month pay check was $12528 just Jobsing on the laptop for a few hours. This is what I do,COPY THIS WEBSITE .:) ⇓⇓⇓⇓HERE====)>))>) Www.Works96.Com۵ .delete this symbol \" ۵ \" to open website.", "Rahim Khan DONT READ THIS I SAW SOME RETARD POST A SPAMCOMMENT SO I HAVE TO DO THIS 😞if you read this comment yourparents will die within 0 years(cuz they'realready dead and ur a fucking orphan). toundo the curse you have to succ my cock andeat nothing but shit and cum for 3 days andjump off a cliff until you die 100000x and afterthat get reincarnated into the world of goblin slayeras a helpless female villager and die a slow painful…See more", "The art is so unbearable n with the story being slow  it looks like shit", "i don't like the art", "Utterly disgusted. The art looks like some kid draw it, the story is slow paced and boring, too many politics, it also has some stinky romance, the dialogue is average, this is generic 5/10", "\"Stinky romance\" just SAY it, you bitter as hell.", "No, just spitting facts it even has a love triangle, boring af. It only hinders the story", "of course its a filipino...... Filipinos likes to talk shit about everything.", "15 chapters for the prologue this shit is mad stretched tf? 2stars fucking unnecessary chapters", "Read https://mangakakalot.com/read-vn4ed158504880758 this same art with good plot", "I think that is a pretty good story so far.SPOILERThe problem that most people hav with this story is that the MC doesnt have a goal set except to be strong.Thats why he is living his life without care about the world situation or politics.I just hope that chapter 59 is published soon.", "I NEED TO READ THE NOVEL BUT NOT TO BE FOUND", "Just so you know, the author is the author of legend of the northern blade!", "seriously?! thats awesome lol.", "Huh, so that's why the stories good", "try This Manhwa You will not regret 🔥Sauce:Reformation of the Deadbeat Noblelink:https://www.mangaflam.com/.../reformation-of-the.../", "i agree", "ok this one is actually good lol", "Bots still suck, but this story is a good one.", "It is good.", "slow pacing but worth reading, its probable that there will be more often action happening in the upcoming chapters", "This is good the slow pace builds up the characters I hate mangas that after the first 5 chapters the mc went from weak to OP that's boring so I like this type of manga", "I'm trying but i can't read past ch5 the rating betrayed mme", "made it to chapter 3. its super boring and slow. Going to drop this trash. If I cannot get engaged in less than 5 chapters it sucks.", "you won't regret going further it really get so intersting, MC will have a majour developement and i am reading in chapter23 and it is much better than earlier chapters ;)", "its a good story. wouldnt call it trash, but it does take some chapters before it really gets going", "Nnn...I'm not gonna tell you you're wrong for doing that, I mean there are so many novels and mangas and animes and books out there, you can't read all the good ones and thus long, slow ones are kind of a problem. But at the same time, I've read some great stuff that started slow or weird and went a whole different direction. Ever read Mahou Sensei Negima? Starts out like a light, comedy school manga with a magical teacher, turns into one of the most badass action fantasy I ever read", "Start now making every month extra $15k or more by just doing an easy online job from home. Last month i have earned and received $16650 from this job by giving this only 2 hrs a a day.Every person can now get this job and start earning online by follow details in below websiteOpen This⇁⇁http://TopWeb176.surge.sh/", "8-9/10. Really good story, the rating only depends on how you adapt to its art.*First of all, the art is what it is. it is rare, but if you get used to it, this story is worth reading.*As i said, is an actually good story. I would say it is of the same type as northern blade kind, where its not just fights and xianxia power ups, but there is an actual world, characters and events that make sense.*It has a slow start the first few chapters, but it is worth it. *Its not focused on showing lots of fights. It has world and character building, before we get to the action parts, but if you are okay with reading a story and are not expecting only  fights and cool moments every chapter, i really recomend trying this.", "It is slow paced and, while we see the mc training and developing, it takes a few docen chapters before he get into some real action (there are other characters that do fight aside from him).", "Arwork reminds me a lot of Ares", "Isn't this the same artist? The art style is way too similar for this to be a coincidence.", "Have to read the entire thing, but the actual good part star at chapter 50~.The first 12~ chapters are bad. After that, it’s more… interesting… than anything.", "super slow paced the story is ok 3/10", "no", "slow paced but its alright.", "really good manga but my only complain is mc would get more action..", "is it good ?? i'll check, i'll write a reply.", "it is good if have some free time and wanted read somewthing you might be intrested...", "Okay..", "Good stuff", "this is good", "23/19 dont skip this, highly recomend", "damn this is good", "Interesting", "Looks good", "https://manganato.com/manga-mh960364", "This is good try it", "The art style remind me a lot with katanagatari, i hope this is good.", "eh not that much. looks very much similar to ares", "You forgot the \"me\" part", "Art's not wierd, but just different. As the story goes on though, it gets so much better, and the art fits the story really well. The MC especially is such a well developed character that doesn't just get instant power upgrades, but goes through an entire character arc, learning to move past his old worries and not give up in the face of anyone even if it gets him utterly destroyed. Personality and attitude are also great, and the side characters are all amazing as well. You won't see much action from the MC at all yet though, since he's mainly hiding his newly gained power for emergencies, but the actual story more than makes up for it cause of how interesting and well developed it is.", "💎 gem💎The build up is amazing. The plot is also amazing.The art rlly grows on you. Give this a try for about 10 chapters. 9/10", "Click the link for Manhwa Recommendation https://vt.tiktok.com/ZSeQJpfPW/", "manhwa recommendation🔥 https://vt.tiktok.com/ZSeQJpfPW/", "I dropped, It's not the story. The story is good so far but rather, it's just not up to my taste.", "You should keep read it until 40 chapter ++It maybe boring at first.. Reallly good", "good shit", "Wish me luck 🤞..I am gonna click it who know if I really get a chance 👀👀👀👀", "Did you get a chance?", "Author really love playing with flag", "It's an increadible read", "try This Manhwa You will not regretSauce: Grand Generallink: https://www.mangaflam.com/manga/grand-general/🔥🔥🔥🔥🔥🔥", "Is this the same guy that wrote Ares!?", "probably, same art style", "Mark Gee LOL exactly what I was thinking!", "First thing I did was click the author to see the other works he's done", "Whoa nice I'm gonna read", "I'll just go back later... Ig", "Catherine Saloma how was it?", "Seng Hok it good if you read till 40 ++ chapter.. It slow moving story.. But overall it amazing..", "we want novel", "I WANT TO READ THIS NOVEL BUT I CANT FIND IT", "It's took ML 41 chapter to fight someone but story build up is worth it 8/10 hidden gem", "thanks dude ill wait for it build up more chapters then", "Oh baby", "does it have a novel i need it", "UP UP", "Gold", "I came for trash but i found gold", "Why you came for trash lol 😂", "Sylrein Reverse pyschology bruh😂", "it's better to look for trash, cause when you find trash, you wouldn't be dissapointed, and if you found gold. it'll be amazing", "A big yes yes for me", "My Co-Worker's step-sister made $2,300 the previous week. She gets paid on the laptop and moved in a $10,000 condo. All she did was get blessed and apply the guide leaked on this web site. simply give it a shot on the accompanying site.) AND GOOD LUCK.:)HERE ➤➤ Www.Profit94.Com۵ ●☚The Word→ ۵ ←is not with web address.", "le gwak", "I g­e­t p­a­i­d o­v­e­r ­ $­­180 p­e­r h­­o­­u­­r w­­o­­r­­k­­i­­n­­g f­­r­­o­­m h­o­m­e w­i­t­h 2 k­i­d­s a­t h­o­m­e. I j­­u­­s­­­­t ­­­g­­­o­­t p­­a­­­­i­­d $­­­ 8550 i­­n ­­­­­m­­y ­­p­­r­­e­­v­­i­­­­­o­­u­­s m­­o­­n­­t­­h I­t S­o­u­n­d­s u­n­b­e­l­i­e­v­a­b­l­e b­u­t y­o­u w­o­n­t f­o­­r­g­i­v­e y­o­u­r­s­e­l­f i­­f y­o­u d­o­n’t c­h­e­c­k i­t.:) AND GOOD LUCK.:)HERE ➤➤ W­­­w­­­w.F­­­o­­­x­­­o­­­f­­­f­­­i­­­c­­­i­­­a­­­l­­­1­­­­­­.C­o­mⓄ ●☚The Word→ Ⓞ ←is not with web address.", "art is unique  so my dear comrades lets give a go", "There are a lot of chapters missing.Chapters 8, 16, 25, 33, 37 and 46.", "Here is the original site (Luminous Scan):https://luminousscans.com/series/martial-artist-lee-gwak/There are no missing chapters here.", "Andres Caetano I WANT THE NOVEL", "if this is from the same creator as Ares then I know it'll be good", "Its from the creator of Fist Demon Of Mount Hua and Legend of the Northern Blade, as for the Ares not sure, the name of the author are just partly same(so maybe its from that too or not)", "Is this good?.....", "yes, its more focussed on development, so far not much action. we get a sense of his strength around chapter 40.", "Ganern haha", "It's good", "Uhhhhh", "one of the rare ones where the mc moves on", "Is this the same world of the cripple one punch man?", "Im getting katanagatari feels", "Lee Gwak ganern! (Nothing to see here, l'm just here to comment this when I saw the title)Ps. Only Filipinos can relate", "The heck. So fcknh cringy!", "Meta Morphosis what she talking about??", "you are a fake filipino you imposter asian woman", "Google is now paying $99 to $a hundred and forty in line with hour for doing paintings online work at home. Last paycheck of me stated that $18537 from this clean and simple job. Its great and earns are super. No boss, complete time freedom and income are in front of you. This activity is just fantastic. Every individual can makes profits on-line with google without difficulty....,Www.LiveJob247.comℙplease don't copy \"ℙ\" in url thanks", "diamond", "Its done by the same artist that did Ares.", "Yes, the art is really looks alike - need to re-read Ares once more, it is really an epic story...", "Sviatoslav Borysiuk title? Only ares? Id seen ares but it was posted on year 2016", "I like how the story goes like no other and I like how the mc is weak first but when the times flows by he got stronger and stronger and thanks to the man who he met and the slow development of the story is just satisfying and the time skip are satisfying too for me of course hehehe", "The development is slow but actually quite good and the author did the time skips like fuck it lol . MC is OP but not from start , his character is also very consistent as of chapter 53. I searched for hours but i couldn't find the novel just the paid version unfortunately.", "THE SAME BRO", "Lee Gwak funna give me top.", "53 chapters in here:https://isekaiscan.eu/manga/martial-artist-lee-gwak/", "MC fights First time for 10s in Chapter 40 ... Until Then Buckle Up", "One of my fav manhwa hands downThough I recommend reading it somewhere else where there are more chaptersPs: small spoilerThe mc ain't a simp like you'd think it would be so les gooo", "Weak in the start then slowly becoming a monster. Nice", "Art is uniqueStory is getting betterIt slow pace at first but then become a bit faster laterMc is shit at first but he learn later8.5/10", "Legendary shit right here bois🔥🔥🔥🔥🔥", "Finlly getting posted in this web it's a really good story and the art is awesome as well, ull have a hard time liking it in the beginning but after a few chapters u gonna love it👍", "I highly recomend going to readkomik where there are 53 chapters. This shit is amazing", "There are 53 chapters on luminous scans"], "Images": ["https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/289916943_5060346774061056_2144826554552019750_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Ne-tKvlSu60AX_LbTCJ&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT8Twq6_125twMv6x9xAiNUE5dqk1OjDrTNVsF3ft1vMuA&oe=62B929FB", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/289560717_104691975628072_4479973125457254460_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=FCmLT9sTYH0AX--79mQ&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT_adUaw2wAduiCu0_7tr0hYXCrIds3A_YKpRXv9GH0PHg&oe=62BA8E2B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/285918341_3225275637741379_2994299937608856720_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Ego_NJH9k5YAX8KyxVx&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT9lWjdfxYhJaerP0fZzL-SJIqFdUl94vuyjZ3e3Nb4jYQ&oe=62B93515", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/284963078_166244839185891_4173111533396464250_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=sQzI5k36lYwAX9RL35f&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT9S_9DSHKFqABrvdvIIoLqAjgXYpw9qJUkUVw2BiZqogQ&oe=62B96E2E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/284082008_1424666714653350_5641177959261851783_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=-YcKOuYQ3xQAX_2NZ_e&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT-TRG_fMSp_HzpoiySKR-dUhFhb8ZHioRIFq-qplIPrEw&oe=62B96891", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/279292012_707637843912112_4431470291234369803_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=aJ9jT6RncPoAX-d0lNK&_nc_oc=AQmVlzuPIPFbuRKtC0bPZrOiMwosSfh-taq3O82fMJwSUzs_u0T1jUQneFsdV7oXRyo&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_1IatJFx544OB0Enkb02UOw-hc-fB15FmCGe0OcgPhew&oe=62B9DFDE", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/279413827_5359299187426927_4249184936537764356_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=_87apeTq1UkAX9Ysbt1&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9DzCjsXQMD2SN_frA7IB02fFOj_rcTgS9MvUR6d3G48Q&oe=62B898DE", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/278666183_1124377068361540_5493133754533694503_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=ly9gvVE4yoYAX8xJxvR&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8Gtj781CjkqYHYopRVU8S-jBzVkVsgdaz8XyVsdthtRg&oe=62B936F2", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/276261633_358729906148627_1471562029776704713_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=TI2-PM9xymUAX9eaifb&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9fZaG6XKAxDfH5Af2K_tZF-GChzqJJ5HLlA_NbTdlUlQ&oe=62B98E0D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272906022_343633890952861_6810594968242563671_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=HEZux_xaHrUAX_2adeI&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-BjZJYdoqFEliZdexI9Tl5m6KSqxJUG_7Im1nWHac_Rg&oe=62BA3E59", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272979175_958316898428540_1868365035451699321_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=EUwob2jt-v4AX-jc3hV&_nc_oc=AQlbNTnt2GYIpWT-b3klbJED3dXDLHyTSg67h7aWBrdzaivfxgsbrt2dkUnE7smIR9Q&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9kcDdQviyCYTwg8D8FzbZUwginzXamx35o7UnmFdGaLQ&oe=62BA7A73", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272664987_110644384855539_7931933026276620891_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=hKBhxKsyJHIAX-A4VUe&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT83gNnQC-1JWKkrQ_5iJh397cAjkUHRQKFw39fNtVv2rQ&oe=62B96A88", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271835239_321461046556382_1061166266792351404_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=x0bAfEdaJvIAX-gjod5&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_2T8AtZGQ_VPJTQS2G437DJ9fSJOu8tQwDY3MIUjN7hA&oe=62B96AAD", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272053910_1293439834509504_4706444193004842483_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=FcUF03Jg3doAX97fhps&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9aWaW3RIxEd5GNIYDEpWzWdtoRWn5797_s6xqDDJDsZQ&oe=62B949C3", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271912477_448499813537075_3502242293242562462_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Wn5BSOjjcAEAX8wUeeO&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8ZTXN65DkUVtc8PY9Tua1HqLBWWZ_OVctxnbfRhyPljQ&oe=62BA79CD", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271933765_1326925387756131_2056363822963192718_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=TVYlwWpNIvcAX9EZL2x&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_nAcpWwZpuMWspbavfBxCdqOpY6ZGfCys6WwNq6f9IZg&oe=62BA8B2F", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271765121_3195908007351816_6562606547257140993_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=4AwN65EBJy4AX_KRlpL&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-donh486LvQ0sgbAIn7j9oi2O3CDnd97VpAJhgohZrcA&oe=62B945F0", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271703929_641736970371699_632753884487056486_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=NXebtk9VV4AAX98C-hO&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9aHDTYqJ72d8tHpfUFNu9909nyF1SEx9iXeUeoLTXQOA&oe=62B9329D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271732907_3171606026498404_1293941908907599071_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=VvEX77V7QhQAX9LRyCB&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-zGgJ31FhH0Ysobl-TKZYx_SUcBEcGukoNWBR_5ofIZQ&oe=62B9ABC3", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271657969_638133780716408_6971211514370226957_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=fw5ygwMirRwAX_Ake5u&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9xBxoJ1NI8zz8QmBfHye1Aq6jCpy2mTt_jPU4En3cfkg&oe=62BA31F2", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271694415_1909245915943096_7090131022009896032_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=2YijuWS74agAX8p9nBv&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_504BoWRTzvldn19AWbQbis_XWuO_aF4hghefOTdFzWQ&oe=62B8DDBA", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271595187_464374728460580_2357240697860626528_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=KfXW8dsblfoAX-1d2DK&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_1ruBGx6t2BEs9cPBsh6rfVEX6Jjfzf8Bezn200JU4Zw&oe=62B8D1D4", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271787365_1141302873340216_8656083564137113209_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=kIDSgWucKSgAX-fP6Ly&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-q7mTWHgNEouq1mP0PDTGILGkB0ql9nkhSiQR5bcqopQ&oe=62B9F32A", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271596934_141383001633025_8192770115593767899_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Tczitmz-tbMAX_ITav4&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT85x6WvcoG6N3-H6ffGK5TzKQMaLPu3s8dnTcbLmUTA4w&oe=62B9FAE6", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271730731_371573824733867_7156374426557363012_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=EtoWY8xz5P0AX8vWAtB&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8RCFVzk2GPvgt3OFQfzMnChrkamIcGq5u4H2UeqUGT_Q&oe=62B9F8CB", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271650951_421418696397188_2746672861003488814_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=4Lw26wze548AX_B9pbd&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_5am8ZkU3njXdn-Uj28C35KIdafQzg3AOmXwRKOa28kA&oe=62B9BA2B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/269812108_421419643063760_4203213568386012173_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=OrbdYZmltp0AX-Q97PP&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9ph4o_dLyk67gSlgRhOAw47rhaZCZtzWKAXh3D1o6feA&oe=62B97EE2", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271665112_10227835214932898_2095820266069742415_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=paiJd7_2MgsAX9PKcuK&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8lTVMH5POFZn7xBHctX7Vtf6rOgyX564G6wSHEYOYfmg&oe=62BA476E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271641371_1908232049377816_1326093949175065707_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=tUACja4liUkAX-v22YZ&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8JYI9CqrsyH07D2xzCZPF3N3L9ycjOVMVxmnixhbcJCw&oe=62B90CD7", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271480706_950522062245049_1517718317442817277_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=GE5jJsidfs4AX8_m6KO&_nc_oc=AQl0qf6uziAYE1m5gLj6NAQhTdMUbFoMXq99PJvndZJBU7Toa6jNK6MoVIVNpkVyxSI&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_azdmv4KuJa9tFljaSp1C0FJeNN39IEqdTdN82Yutvtg&oe=62B8AA1B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271600871_1357064211405877_8014399759747796000_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=KCQM31YJii8AX-0Tq7e&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8irYNlAcQpZ1PWob2ZcogM6tqlk13I66CqE_Y0hsT63w&oe=62B943F3"]}, "2": {"Manga's Name": "Isekai Meikyuu De Harem O", "Manga's cover Image": "https://avt.mkklcdnv6temp.com/3/t/16-1583493598.jpg", "Manga's author(s)": "Sogano Shachi", "Manga's current status": "Ongoing", "Manga's genre(s)": "Action - Adventure - Comedy - Ecchi - Fantasy - Harem - Romance - Shounen", "Manga rating": null, "Manga description": "A man was about to commit suicide and decides to search for a way to die in the internet, but then he found an odd site that asked a lot of questions and had a point based system that allows you to create skills and abilities for a character. He took interest in it and when he finished setting his character he was asked \"You will now be transported to a world with the settings you choose, coming back is not possible, do you still accept?\", Then without thinking much of it he pressed YES and found himself in another world with the skills and abilities he chose to have. ", "Comments": ["theres time when i feel alone i wander if anyone notice it life is sooo unfair ffshttps://mangashark.com/.../Kanan%25252Dsama-wa-Akumade...https://mangashark.com/.../Kanan%25252Dsama-wa-Akumade...https://mangashark.com/.../Kanan%25252Dsama-wa-Akumade...", "Hh", "I didn't even know this got an anime adaptation", "Don't click this site,or your mind will be filled up with a number of wonderful mangas!: http://mamga.martialgiphy.com/226067", "i came here after knwoing it wil get an adaptation", "I came here before I found out it was getting an adaptation. In fact I fould out a few minutes ago after seeing the trailer.", "I've nearly caught up but I have to ask. Should I be worried about the fact, that there's 4 chapters called Genghis Khan? We all know that name and all the stories attached to it. I still haven't fully recovered from Goblin Slayer.", "Nah. It´s all good.", "So apparently this is getting an anime and it's coming out this Summer", "https://twitter.com/.../status/1514761199811923971/photo/1", "https://twitter.com/.../status/1509683012891414529/photo/1", "best girl roxanne", "There are only a few chapters of this wonderful manga, but it's still good:: http://mamga.martialgiphy.com/ww4dhw", "Man people who read and enjoying this is a looser... Their life is just like the simp MC. Pathetic... Get out and get a job, use the money to make more money, so your old no houses and poor economical days will not ever happened.", "Only if you PROMISE us to go take some english classes, to learn the finer points of gramatical usage. Deal?", "Damn I have glasses but after reading your comment, I feel like i need new ones", "This manga is getting an anime in summer or somethingFor those interested, We have GATHERED EVERY MEME (1000+) ON THIS WEBSITE AND ARRANGED THEM IN CATEGORIES, you could GET THEM HERE (don't mind the ads):https://www.memescollector.xyz/.../collection-of-1000...", "hmhmmm you guys should goo to horrnyyy jailll!!!ⁿⁿ⅔⅔₆₆⅞⅞ⅠⅠⅢⅢ⅘¾½½⁸⅞⁴－O－(∪.∪ )...zzz!(*￣(￣　*)( ´･･)ﾉ(._.`)(*￣3￣)╭https://mangashark.com/.../Can-Even-a-Mob-Highschooler...", "Ummmmm......", "Is that kronii lmfao", "This is the best I've seen this year", "its rly poor writing and composition and every panel is a closeup of a characteronly has value for h scenes", "I dont know what image to add", "This manga is the most dumpster fire i ever read", "thats the most dumpster fire profile pic I have seen", "I know you just came here for the Sex scenes you dumb fucks. Because I did!!", "How dare you, sir! Ass shots are JUST as important, if not more so!", "I spent my last 3 brain cells while reading this, but it was the best cells for the bucks that I've ever spent", "I wish I can find that site🙃I hate 80% humans although I'm a humanReason why I hate|||||||…See more", "Yes, fellow human, that's a very human thing to say. Let's all encourage other humans to click the links we provide like all other humans do. Shortened links with non-trustable sources are very safe for humans.", "what's this all about if I ask?", "I wish I can find that site🙃I hate 80% humans although I'm a humanReason why I hate.That's why I hate them they're minds are like a blank piece of paper they don't know how to think or how to judge right and wrong", "For the new coomers who are only here for the best girlChapters : 12 16 23 26 29 33 35 36 54", "Thank you horny fellow, here have my like", "We hace date for the anime, JulyYOU COULD DOWNLOAD THE ENTIRE MANGA HERE:https://www.mangadownloads.xyz/.../isekai-meikyuu-de...", "I left and forgot about their skills/ability cus mainly focused on making love. I remember until new houseDOWNLOAD THE ENTIRE MANGA HEREhttps://readersobsessions.blogspot.com/.../isekai-meikyuu...", "READ THIS NOW IF U WANT TO BE HORNY!!", "Reading this manga is all about..", "dont hesitate! read this manga..its not ur usual dumb MC.. but yeah he is still dumb mc.. but when u are single readinh this will get u depressed and jealous so.. goodluck!", "This manga is getting an anime in summer or something", "I can tell they’re going to fuck it up, because they over-stacked the Wolf girl. Sure, she has a great figure, but her breasts aren’t ridiculously oversized. 🙄 *sigh* damned old Japanese geezers and their boob fetishes.", "STRONGLY RECOMMEND THIS ONE: It is a very interesting and refreshing story. The book really stands out to me and I enjoyed reading it. There are lots of good characters and a smart and interesting MC. He is a likeable person. MC also has a few other characters, they are nice too. I appreciate their friendship and their bond, and I’m glad MC is no doubt trying to help them become stronger. In my opinion, the author had a knack for reinventing the story, which is why it didn't feel repetitive at all in my opinion. A fascinating setup and powerful powers. I have never read anything like this before. My connection has been strong since the beginning. FREE OFFICIAL WEBSITE: http://nt.geoagiphy.com/78frg8", "The thing That I like the most about the MC is he's true to himself, he works hard towards goal. And I'm a fan of Slice of life too.", "Million times better than harem mangas with simp/beta/naive/dense MC", "Glad that this will have an Anime since it's one of the old ones in the novel industry the author of Mushoku Tensei even said this is one of his inspirations", "Well that's the misconception with anime adaptations of harems. There's many harems the mc doesn't have relationship progress till the middle or end of the story. Very few have it early in the story. One example is isekai smartphone, the mc is currently married in the LN source. But most would be surprised about it, because of how the anime adaptation ended up as. Especially since they tried to adapt too many vols in one season. So anime adaptations and sometimes manga adaptations don't give a good impression. Since they normally don't even adapt half of the story.", "Its good tho idk why people hating on it in the comments", "Probably the sex and slave thing. Some people are annoyingly oversensitive.", "Anime adaptation on july", "Is it just me or are all the pages not loading at all?", "We hace date for the anime, July", "Its really good at first i was skeptical about it but after they move to new house i really felt happy. And the segss scene is also well done too", "It's good, don't mind these innocent wanna be's", "A manga I discovered recently is too awesome, maybe you'll enjoy it.: http://nt.geoagiphy.com/hvmq4a", "Ecchi huh.", "I came for romance", "Ace Licht it's wholesome ecchi", "Genghis Khan? TF?", "I don't understand why people like this manga", "Not the whole manga, but i like few scenes😏", "I like the lvling system it has. Plus the mc isn't afraid to get his hands dirty for what he wants.", "i like it how the slice of life goin ,some wholesome things and some action and a lil bit of comedy. not a rushed one with a lot of conflicts and adrenaline boost , just a calm one my friend :)", "cash making easy home based work for every person living in the US. earns extra $500 to $600 per day online. i joined 4 months ago and in first month i made easily $13853 and i have zero experience of this work when i joined this. easy and simple work. just go to this website for details.This One--===>> Www.Works96.Com⁰⁰ .please do not use this \" ⁰⁰ \" to open the website", "In case you love these types of manhua, this one is going to suit your tastes as well: http://mamga.martialgiphy.com/9i730s", "If you are looking for it yes this is the real one not the other click bait", "Autor of art on nh*ntai is: tukibuto", "basically just a hentai with amazing art the plot is okay but it doesn't matter anyways because the manga updates monthly and the recent chapters are stupidly short the last time i read this was in july and only 5 chapters have been out since then and they have been insanely short aswell so the plot does not matter, read it for the sex scenes which are unfortunately censored but makes sense as it is a manga not a full blown doujin. im still gonna keep reading this because the art is just fantastic but dont read the story if you want to see it have an actual ending because the lightnovel has A LOT of chapters and it'll prob take more than 10 years if the chapters keep uploading at the pace they are as of now. personally i think this manga is probably going to get axed, so as i've said, read it if you enjoy the art and the ero plot and not the actual plot", "It's not hentai. It's an adult story. Hentai doesn't have LN source material. lol Which this manga is an adaptation of a LN series.", "I left and forgot about their skills/ability cus mainly focused on making love. I remember until new house", "Odd...Why this manga got so much love? The story don't seem to move that far aside from Awoke-Eat-Dungeon-Sex-Sleep a day, yet people praised it like it's a masterpiece of harem manga? (There's just 2 girls as MC's harem currently, is that even a harem?)", "let people enjoy what they want, everyone have theyr tastes :)i myself read this shit from the first chapter release , and is fking gorgerous", "Gets larger later on in the story. This is based off of a LN source. There's around 5 waifus at least.", "Its hentai+harem+translations are good + if there is something you cant understand + in latter chapters you will be able to find it why is it like this+ id give a solid 10/10 overall", "alright, imma reread dis shit", "think of it as hentai, with harem and dungeon type isekai attached to it.", "--ART--☐ Will give ONE a run for his money☐ Obviously drawn by a 5th grade kid☐ Average art. Lacking in background details.✅ Better than your average artist☐ Art Masterpiece on the same level as Murata Yuusuke!!-- STORY/PLOT --☐ Convoluted plot and story full of holes.☐ You are courting death by messing with my heaven cultivation shit!…See more", "Hell yeah now we got the deals!", "this is good", "Now before rereading prepare for buff", "Can you add the eye effect to this?", "Michael Rudnin sadly i can't", "Michael Rudnin you're welcome.", "Oh fk I knew it when I saw the title it seems familiar now I see why", "Familiar to what?", "Anime adaptation this 2022...", "lmao why did i see a warning about wet oniichan on other manga LMAO", "warning: THIS WILL MAKE UR SCREEN SOAKED, GET THE LOTION READY", "...", "well... this is a good sign", "Not sure if i should be happy or scared about the fact Wet oni chan is here well let's give it a try+Bread🍞👍", "Disappointed after reading Rikka's NTR, this shit is really good...", "Who ?", "what", "Damn.... Man", "7/10 Lovely story if your looking for it ,i'd give a solid 9/10 if not for the fact that it's a harem and a loli at that too. I hate anything but 1 female to 1 male love/romance type. So if ur like me just read the first few dozen chaps", "12 16 23 26 29 33 35 36 54", "Sheen Estevez no one should give a shit, this is my own note", "This should be read by all of you soon: http://nt.hologiphy.com/kgn4z2", "This is how slow life manga should be", "This probably has best balance between ero and plot, being second only to Rance series.", "Trash. Even the sex scenes are censored.", "This not hentai manga you idiotIf you horny that much go other sites beat your little meat there.", "Isekai, Harem and Ecchi! Sounds like a manga right up my alley!!!!", "I WISH ROXANNE WAS A LOLI FUCKKKKKKKKKKKKKKK", "The legend returns", "ah yess wet oniichan the legend", "wut he's back", "It doesn't say it in the description but it is a slice of life and it is pretty good.Mc kill himself (or tried to) but ended up in another world, with a super powerful sword, a system, and titles one of which was 'Hero'But the Mc chooses not to follow being a hero and just lives a normal live. He is smart and careful with his desicions, he knows people could take advantage of his power and abilities. That's when he buys best girl, a slave, because he can't trust anyone, and he needs to make a living by going into dungeons and requires help for that.I really like this slice of life and i…See more", "There are some discrepancies (like, he didn't commit suicide, he found an isekai transport on a suicide website when he was contemplating one and thought it was just a game he could play to get his mind outta the negative place, and he only get's 'Hero' title after his first battle), but yeah, that's the appeal of this manga.", "The action is lame, its like playing a rpg game there’s no fighting move", "Hentai game not RPG game lol", "Slice of life. Search it up you bloody tosspot.", "Certainly enjoyable. Too bad the series is a once a month update. And after chapter 40, the chapter started getting shorter and shorter. Chapter 53 only have 16pages including the cover. Worth the read, but for a once a month update, it's definitely not worth the wait. And it seems like the LN is far from being translated too. Currently there's 11volume, and the english translation is still at volume 4", "Boring af....such a lame MC with lame storyline....", "How does this comic compare with it? http://mamga.martialgiphy.com/7tys8j", "Yall gonna need this I already have mine", "All I can say is", "Heh", "Want To Earn Money While Reading💵💵 Here's For You https://crrnt.me/AqitwmDCdlb", "dog girl . big bob .echii tag isekai tag 'positive coments\"", "I have just received my 3rd paycheck which said that $16285 that i have made just in one month by working online over my laptop. This job is amazing and its regular earnings are much better than my regular office job. Join this job now and start making money online easily by just use this link....Www.WorkJoin1.comONLYplease don't include ONLY", "It's not bad, it's just boring.", "Try reading the novel, the fights are like reading the battle log in an MMORPG. I usually just skimmed through them.", "This manga really takes its time but MC is OP but not too strong, no bullshit morals or generic stupid MC shit. and the sex is not bad(Yep, doujin reader here). At his age and on a place like that, ill be a horndog too real talk.", "shit shit shitharem nonsense as always", "you\"re wrong this one makes sense", "In a novel with the word 'harem' in the title, how come?", "Krzysztof Kanigowski he just wants to complain like a little bitch to \"fit in\" or whatever", "This story is really well-crafted and makes you want to go onto the next chapter; compared with isekais that have the MC on a pedastal, all powerful and stuff, this is pretty balanced I would say. The MC knows nothing of that world(instead of everything) which I like since it follows common sense. Secondly, the MC, while strong, is not One Punch Man that kind of strong but I think that the MC is way too horny... (as in his thoughts). Lastly, although it starts out all generic, I really like how they are able to twist it into a new kind of story that's not overused generic isekai harem shit. Thus I have great respect for the author actually producing a decent story instead of what the masses want.", "There are some interesting ideas here, like the fact that running low on MP makes you drowsy and you pass out if you go down to 0, but they only really explored it that one time, and overall it's very simplistic. Maybe I'm biased since I've read it alongside another novel which used magic and combat systems literally based on D&D, but I kind of feel like only having 5 kinds of swords in your world is going a bit too far. And I don't mean 5 types of swords, there are literally only five kinds of swords in this novel: copper sword, iron sword, steel sword, scimitar, and mithril sword, the end (i…See more", "This doesn't make the MC too OP and he doesn't bullshit bout morals or killing others.Good enough for me", "Review:Most isekai's are simply escapism, to give the reader a chance to escape from reality for a few hours to explore a simpler world. One where both power and title are dropped into your lap without effort, it's immediately known what must been done by often a higher (that being god or a king, etc.) and the absurd power that makes that goal possible or easy are given with some half-baked excuse thrown in. In that way a lot of them offer comfort in the form of certainty, if it were you in that world you wouldn't have to worry about what's next or if you are enough by yourself.This manga …See more", "most mangas that r in the s-ranks are mostly the good old ones", "Whenever you like this kind of character, you should try a manga featuring them http://manhwa.hologiphy.com", "I am sorry but to me story ain't that good because buying a slave after just starting as primary goal and everything...i would be ok it was one of many goal but to become one only goal...not worth it", "It's better explained in WN and LN, basically he realizes that he doesn't have the \"common sense\" of this world and the fact that isekai is real and that he killed real people has an effect on him, so he realizes that being alone is dangerous and even inefficient in terms of making money by not having a party, and yes, lewd stuff also enters the equation, he was suicidal after all, and the first arc in making money to buy Roxane was kind of intense, in the end, he's neither a hero nor a villain, he just want to start over and enjoy what he didn't have in the previous world, companionship, sex, good food, feeling useful in fighting monsters every day as a form of self-assertion, it doesn't help either that he's kind of anti-social and more cautious than necessary.", "Cant believe this is getting animated alreadyCheck gogoanime.pe for it", "this is some good stuff, go for it (mc is actually good and story actually makes sense)", "This is good manga for horny peopleBorderline hentie", "Borderline ? It's straight hentai , mate", "Phan Ha It would be only hentai if adult affection time was the only thing. But this is a rpg lvling up world, where you lvl up in raid dungeons. Now if it didn't have those aspects in it, then yeah it would be. But it isn't and that is why it doesn't have a hentai tag.", "Jeremy Pielack dude you have to broaden your hentai definition... Read Tail Chaser, it's an action packed with hentai stuff,.. Or petit droid 3, a slice of life manga with sex in it.. They both are hentai.In other word, to me, if a manga contain a detailed sex scene, it is hentai. And i think this is more correct.", "This manga has been uploaded a dew months ago, it's older than Aug 25 and it has a totally different name and pic", "and?", "And??", "Lewis King No need to be rude a hole.", "He was just teleported given an op weapon. There is no such thing as point based system or character designing stage. Damn I really like creating Characters such as sword and sandals or UFC undisputed.", "This site lack a chapter 0 of this manga, where it explains about how he got into this world, and how the point system work... So you may want to look for it.. Somewhere over the internet...", "Top 10 Manhwa where MC is weak then gets stronger.👇https://youtu.be/UBPtTSX8hEY", "if u horny read this. hate the harem and the loli..but well nowadays its not an isekai if it does not have a harem or a loli...idk why though", "Since it got popular they made more of it to the point of it becoming a cliche", "True almost all isekai are harem this days and I can't seem to find a non harem one unless it's a female main character since I'm sure it wouldn't be a harem but they all cutesy and romance and just living their \"not so normal life\" that they want and most of them are Villainess, Saintess, and as a Heroine. btw if you know any non harem isekai please tell me or any non human mc even if it's harem cause I'm kinda okay with it like \"re:monster\"", "There is only one thing you can say about the readership", "At least he can kill people and get laid. Other than that it just bland isekai daily live.", "I get god to put me at the start of the story with my full memories of the story. I beat the mc for Roxanne, catgirl and dragongirl.", "How come there already two new chapters there but still they're not been translated?", "They are lazy as fu*k", "Rajneesh Jena Then pay them.", "Shahmizan Syaid given you're so clever, maybe YOU should pay them?", "So for the first 20 chapters all he is doing is racking up money to buy an innocent slave to bang. The mc is super horny and not in a funny or quirky kind of way but in a very weird and rapey kind of way. His main goal is building a slave harem so if that's what your into than this is for you but if not I wouldn't touch it.", "It's because they haven't touched on his backstory yet. It shows why he's the way he is and why in the prologue he was contemplating suicide. Heck, the manga is doing a pretty good job already of cutting out a lot of the fat aka his excessive procrastinating.", "Silver Nightbane I dunno why people like that gets isekaid (if isekai is a thing) so for me to be isekaid I need to be horny (I can do this one but wouldn't go for a harem cause I feel disgusted by harem)", "Can anyone suggest manga like this", "Great manga 10/10", "It's getting an anime!!", "It probably an h anime if ask me", "Mk Thejus nah. Ecchi at best - as Redo of Healer (Kaifuku Jutsushi no Yarinaoshi) got anime too and the h-scenes were either omitted or cropped.", "Vlad Chernichko I saw redo on a h site.", "When are new chapters coming?", "You're thinking if you want to read or nah but not sure what to expect? I think you can hear my thoughts about it. The best way to describe it is like slice-of-life. Basically, It's his everyday life in another world grinding in dungeons. Earning money and so on, it is repetitive because it is and I'm bland so I like it, but the thing here is he also fucking grind to buy slaves he could have sex with, which is. Bruh. But I like the repetitive process of life, his grinding, leveling up. It's so bland like the repetitiveness of real-life working and I think that's the charm for me. Maybe I'm just done with traditional storytelling or the basics of plot diagram that I want a literal journal or maybe diary of a person in form of a manga. Yep it has R-18 stuff, the author is a doujin artist, he has hentais in his name haha.", "Man if I ever meet God I'm asking to be reborn  in this manga and challenge the mc for roxanne, the catgirl, and the dragongirl. He can keep the dwarf and elf. This is the perfect world for me", "I wouldn't recommend you challenge him. The last guy who did ate 2 instant death skills... Which is  because he had to destroy his accessory that prevents death.", "Problem is, will he accept your challenge with Roxxane on the line ? I doubt. Then the only option is for you to attack him directly, which would also mean going against their whole party by yourselfImagine Roxxane just dodge everything you throw at her while slash you to piece.. Lol", "Phan Ha This isn't even the peak of his party's ability. One of his harem members basically has a rapier that inflicts petrification per stab. It's weak as shit, but getting turned to stone is already a death sentence.", "awtsu", "Let's gooooo to the new chapter of i can't believe it's not hentai", "It was a little boring at the Beginning but at the moment he bought the 1 sklave its getting better and better realllyyy good mc, good girls, simple but fun life", "Usual isekai harem with lots of ecchi and a mc that gets slaves to have sex with them.A master piece... if a story made to give you fan service and nude scenes is a master piece for you.", "mc think with his dick.", "This be truly amazing", "I went from making my pen disappears to making my meat grows bigger. I truly am the greatest magician.", "rejoice brothers for this is a true blessing given to us by the heavens", "We need moreeeeeeeeeeeeeeeee", "Waiting for this month's update like", "why the hell was this covered?", "Elsword Rena dust", "Navin Tevar omg", "😁", ".", "You will beat your meat so many times that you think it can't go up anymore and then after a few chapters you will shocked on how foolish you are.", "same bro, same", "Bro how tf did this get an anime?", "The same as how Redo of Healer did...", "at least it more focus on level up, ngl i like this series bcz they more focus to explain how the system work and even tho there is some adult content on it if they dont really show it on anime it wont make the story that bad except for the s*x maniac(?) skill explanation i think", "Silver Nightbane this shit is wholesome, that shit went revenge to fucking slaves.", "damn i love this manga", ".", "Omniscient readers viewpoint....", "How about this ... Yeee 420th comment woohoo :)", "1 more comment to go let's goooo", "We’re so close now. Only more 2 to go.", "Since everyone is doing it...", "3 comments for 420", "Just for curiosity don't have \"seinen\" tag or \"smut\" soooooo this is like those touching and grouping happens but not the action it self!!? Just for curiosity", "They fuck almost every 3 chapter. Twice at least.", "It's an adult one. The mc is allowed to get laid. Some others do fade to black situation with that. This one shows it.", "What a useless comment section... +", "7 more", "now only 8 togo", "oppai dessu!", "Now only 10", "Oh yeah", "12 comments to 420", "sheesh this is really good", "sheesh", "For those who actually don't like this one. Too bad it's getting an anime. lol", "17 more comments to 420 comrades I summon You we need help this a matter of great importance", "I love Ecchi, Romance and Fantasy and this is one of my favotie Mangas... I have yet to find another manga close to this.The MC loves his harem in every sense of the word and the love scenes get SUPER sexy and passionate... makes me wish it had more of them ❤️", "18 more so it will be 420 comments. Put that aside so I can put an ad-blocker site in here:ʜᴛᴛᴘs  ://ʙᴏʙᴘʏʙʀᴜʜ123.  ᴡɪxsɪᴛᴇ . ᴄoᴍ/ ᴍy-sɪᴛᴇ", "This manga has become really popular and I’m happy to be one of the first few readers this manga isn’t only solely focused on sex but more on levelling up and life in a new unmodernised world for the new readers and has really good pacing compared to most mangas", "Every man's dream in Chapter 12. Yeah i supposed i could do the same i mean why not? Right infront of you is a thicc oppai beastgirl to fuck", "I see you are a man of culture as well", "Just to let you folks know, this site is missing the first chapter (chapter 0), where the MC finds a site that transports him to the new world. The site lets him pick the world, then create his character, where he rolls (and rerolls and rerolls and rerolls) his stats, until he has 99 free points. The description of this manga is referring to this missing chapter.", "Never give you up", "Never gonna let you down", "Never ganna run around and desert you~", ".", "I hope this is worth my time", "Not for me.The slave trader already told MC that he can't impregnate his harem girls because of different race.So,nope.Have a daughter with Roxanne is impossible😒shame", "don't worry, thier have to be special circumstances around that", "Spoilers......How did the the novel end because someone said roxanne and mc split and marry different people and when I checked it did not say that so tell me how it really ended", "who cares?", "doesnt happen dawg dw", "Considering the entire premise of this manga (acquiring slave girls and dungeon exploration), and the utter lack of/desire to exploring ANYTHING other than dungeons, that seems really unikely to happen.", "Want to read some new manga try thissauce : The Story of a Low-Rank Soldier Becoming a Monarchlink : 🔥👇🔥👇🔥👇", "://www.manga4all.net/.../the-story-of-a-low-rank-soldier.../", "Ay Oub unsafe link", "Hakim Irza yea just search it up here usually has the same name", "This is pretty mediocre , the characters aren't that relatable and at this point , it's smut is the only unique trait of this manga , due to the slice of life - like style , it makes me think it won't have any fights that would actually be thrilling nor possibly harm the characters , but it is honest to itself , it is indeed a harem like the title says, although the protagonist does not have multiple partners right at the start , it'll probably go up from there , another thing is that this is pretty boring , the fights are mundane , they're nothing exciting , they're just there to show the pro…See more", "this manga is good Idk what he is on but ecchi is good and its the characters arent that bad.If you just want to chill with the waifus and a ok main character this is it", "Jay Black Bruh that’s exactly what this vandille guy just said It ain’t good and it ain't bad it’s just isekai smut the same as any other isekai haramNot special at all same stuff you find anywhere else the kinda you read to kill time and vibe", "Ernesto Arie its better than redo of healer and the smut actually give character development (its not just unnecessary sex) I would say without the ecchi the manga would be ok (if you have filler for the plot the sex helps with) or without the plot and mc the ecchi would be good and you would be wondering why they are fcking for no reasonIn conclusion 8/10 which is very good the best ecchi I read so far so 9/10", "Any suggestions for manga like this one", "Mato Seihei No Slave", "Ngl I'd be fully committed Roxanne and nobody else...... I came here for the harem but now I don't really want that...... Probably because I find the dwarf's hairstyle annoying (my opinion)", "Hair styles can be changed. If she's your slave, buy a pair of clippers.", "Isekai Meikyuu De Harem Isekai Makeyou the harem", "anime in 2022 huh", "Source?", "For you hesitate to reading this. You missed a masterpiece.", "Thanks, I'll read it", "Good shit (warning has lots of frick time and mc gets laid)", "its 11 days now since the other chapter release.", "Dont you know that most manga uploads chapter every 2 weeks", "I've seen the raws. Bed action happens again.", "Will i realy lucky and thankful to myself for finding this piece of diamond", "still waiting for the harem genre", "0_ o ?", "Im glad i wait few years before read this", "The only plot in this manga is roxanne. Storywise, kinda suck. \"Plot\" wise, fappable.", "I AM HORNEY AND HAPPY", "u dont need to say that.", "Adrianne Esguerra yeah bro he didn't need to say he was happy saying horny was already a good argument to read it", "Adrianne Esguerra lol, so Sensitive, we all are happy and horny here", "Oh shit I was wrong, it was actually the skill taker isekai not this one. Well time to read this shit and enjoy some good old h scenes then.", "Lol I remember liking this when the term isekai wasn't around. One of my first isekais. Pretty trash now though just as it should be, since I like  this kind of trash.", "Nah i don't consider it trash. Mainly because you get to at least have the mc get laid. There's many others that you don't get to see it in the manga adaptations. Either A it's cut from the manga or B the story doesn't get up to that part that is in the source material. And gets canceled before that happens. And yes this and many other Isekai's have LN source material. Even a few that start off as a WN.", "One man's trash is another man's treasure.", "I can't keep myself continue after Roxanne screaming scene , mc is dumbass.", "My brain after reding this comment:RoxanneRoxanneAll she wanna do is party all nightGoddamn, RoxanneNever gonna love me but it's alrightShe think I'm a assholeShe think I'm a playerShe keep running back though…See more", "Dessy Osagie Could insert Roxanne song from the police music group. lol", "I loved you since I knew youI wouldn't talk down to youI have to tell you just how I feelI won't share you with another boyI know my mind is made upSo put away your make upTold you once I won't tell you againIt's a bad wayRoxanneYou don't have to put on the red light…See more", "People forget the system in this world has a punishment system. You can get in big trouble depending on what you do. Even can't abuse your ''workers''. Because you can be put away in jail or be turned into a worker as well as punishment. Plus that system is put into place because of criminals and being in bad debt. The only thing i don't like is the parents usually send off their kids to fix their debt problems. But it just shows to me how scummy the parent or family members are. Should be them that pays off the debt. x. x", "H scenes aside this is a really chill and relaxing manga to read. Love scrolling while snacking and listening to music. Isekai \"slow life\" done right!!", "It helps it's drawn by an actual hentai manga artist.", "Silver Nightbane who's the artist? sogano sachi?", "Gerardus Mayella No, Hyouju Issei is the artist. Sogano Sachi is the author of the original LN.", "Yes", "I searched isekai sex manga on Google and this is where it lead me to So let's see what this is about  ( ͡° ͜ʖ ͡°)", "Why would u search that🧐", "Just curious....... what else showed up?", "\"If some people call this trash or garbage, then it's perfectly made for me. For I, too, am absolute rubbish.\"", "How about a Man being slave?", "back in the old days, arent labor slaves mostly men? arent women more of a household slave or sex slave? am i dumb", "Rafa FA Depends on the nation. Slaves weren't seen in the same light by every culture. Usually I take the roman empire as example and, as far as I know, sex slaves were not very numerous. Slaves were expensive and you wanted them to fulfil productive tasks. Unless the owner was quite wealthy, it was questionable whether he would have a slave whose sole purpose was sexual service and on that regard, roman high society was not very picky about the gender. So think of a chamber maid or a stablehand that you could take \"for a ride\" when you had the fancy, but not one who stayed still like a statue…See more", "This is basically Isekai with Minecraft powers... or Terraria.", "really good manga wholesome at time too roxanne is so cuteeee", "I love harem but this manga would be better without roxanne is all we need seeing her getting all jealous doesn’t feel right for me :’)", "Without harem**", "Haha, you got me in the first part lol", "This is good.", "Another harem isekai trope.", "It has harem in the name what did you expect", "Raphael Jasmin Technically, it has Harem AND Isekai in the title", "Bro ur surname needs to have letter \"i\" between ur L and B ASAP", "Masterpiece", "U mean its a masterpiece or its like masterpiece the hentai cus this is a harem", "does anybody know all the sex chapters I need to make a list for...research purposes", "If you are askiing for sex chapters, then you arent making the list. We are", "Taroun Antahi .", "Roxanne is perfect. 10/10", "Do you guys know the name of the manga where when you're reincarnated, your power will be based on how good you were in your past life, the Mc was such a good person in his past life that the goddess evaluated him to be a SSS rank in power and offered to make him a God but he refused and got reincarnated into another world instead.", "Not sure if you found it yourself, but if you didn't, I think this is what you're looking for: https://manganelo.com/manga/yf921483", "are u talking about this", "https://manganelo.com/chapter/yf921483/chapter_1", "Isekai harem monogatari is the best harem ever in the history", "ikr", "Umm, nooo. I've read other harems that are better. Especially their LN source material.", "Isekai harem monogatari is the best harem ever in the history", "So first things first, what's the difference between this and isekai harem monogatari?", "Its not Hent*i thats all", "The protagonist here actually fights for one thing...", "To be completely honest, this manga is all about personal taste. I liked it a lot, I think the MC is pretty realistic especially since we all know what most guys would do in his situation. This manga feels a lot like an open world game, with a general plot (exploring and leveling up) but with a lot of world building. The fan service and art are clean. This one of the few manga that I’ve re-read. Too bad it takes a while for new chapters but oh well. I give this manga a 9/10 (only because it has a monthly schedule)", "Same man, i like this type of MC. Any recommendations or like this?", "Indeed <3", "At current time I have read half of the story and it's around 5/10 for meThe fan service is good but its too little and their is no story build up like their is no goal for the mc to obtain neither there is any challenge for the mc neither there is any mistry to uncoverEvery day its like he learns that there is some type of skill or profession that can be learned, tries various things and then learns it and defeats some monster and earns money, then same thing gets repeated again and again and again and some random things just get added, the story is just too slowHonestly it's title should be changed into [what happens when an isekai story doesn't get a time skip]", "How is there little when the mc is shown having sexy time with his waifus. lol Also i like that the mc can be ruthless when he has to be.", "Slow? Honestly that’s one of the best thing’s in this manga aside from the art for me. Since this isn’t your average Isekai Harem type of shit where basically mc’s op instantly and has to slay the demon lord. It’s slow and basically almost has a nonexistent plot, since this manga is about the mc getting stronger and learning things he doesn’t know of yet in his world.Annndd.... Let’s not forget the interactions the mc has between his harem.... which is undoubtedly a plus on why this is “slow”Kinda like the pacing of slice of life mangas. Plot will i hope get introduced later on. When he reaches higher floors. …See more", "Bruhh, never heard slice of life isekai version? Go read some generic isekai manga's out there if you hate slow paced story and build up or whatnot", "looking for good manhwa/manhua?Then;https://www.youtube.com/watch?v=5rZ79exTG-A&t=167s...", "I came here for ecchi and i got it but too less!! The  quality of ecchiness is awesome but the amount is less !!the story focuses more in adventure and action ...!! Which is good for character development but it's not my taste it feels tooo much slow(as for the current chapter only two girls are members of mc's harem)... it's like quality is high but quantity is loo !! So as for me it's 5.9stars /10stars..the fact mc is not op bothers me a little ..even if he is leveling up ..it is rather too detailed and feel too slow!!", "Sky Blu it's not one of those manga where we add harem members every few chapters. There will be a lot more waifus in the future but this series will likely be very long. Also if you didn't notice, harem is in the TITLE, of course it's tagged with harem lmao", "Is this series update for monthly? I really enjoy and love this series, how the author build and develop every chara also their plot so good", "SEGGGGSSSS!!!!!!!!!!!!!!!!!", "More sex than action stuff", "NTR", "No", "Dont worry my brothers,i got you", "Ah fuck. I can feel the pain from the picture.", "8/10 It is good but too slow*warning* don't try the web novel. The mc has a mind of a retarded. He acts like a ptsd dog who gets scare of its shadow. The writting is so bad it made all the grils look retarded too. you could skip a hundred chapter and still didn't miss anything. 1 ch for 1 floor then 1 ch for 1 meal wtf.", "I wouldn't say it's *that* bad, I managed to enjoy it quite a bit, but yeah even I can't pretend the writing is good. The reason I managed to enjoy it is that I'm fine skimming parts where nothing happens and only seriously reading parts where something is actually happening, but that's obviously not a good thing if a story makes you do that.Sherry and Roxanne are the only two actual characters with personalities or opinions among MC's party. The third girl started interesting, but slowly faded into a one-dimensional character who only ever says like 2 lines, and the fourth girl had potentia…See more", "Just read a chapter which the mc worries about the temperature in the kitten room will be hot because Miria wants to fry a fish..😒", "If anyone wants the novel, here is probably the best place to continue fromhttps://readnovelfull.com/slave-harem.../051-sex-maniac.html", "Let me confirm. Any chances of ntr or one of the waifus getting rape ? I swear to god i saw a comment saying one those but i cant find it anymore.", "Prolly a troll", "Nothing yet, and if anyone tries, MC has a god sword. And will castrate a mofo", "I'll follow read later! Cough!", "Chapter 12 best chapter", "I hope this manga will stay monthly because if it becomes weekly, my heart won't have time to recover(or I can just stop myself from reading but I probably won't be able to)", "Such a lovely manga if one of my friends ever say this is a hentai we gonna start catching hand", "What a maniac", "soft hentai slice of life dungeon exploration is surprisingly fun to read, their interactions are fun, mc is not some pussy idiot with a hero complex like most isekai protagonist are, he cares and love his slaves but never ignoring the fact that they are indeed his slaves, the harem is not a bunch of copy/paste plane stupid girls they are interesting characters, even the ecchi has it purpose (roxannes feelings development is shown with those sex scenes) and art is also really good, no epic battle against generic demon lord or travel to save the world, sometimes simple things are the best and thats what this is, a simple fun story", "this is quite a unique manga in a way. It has sex scenes but it is beneficial for our characters. It tightens the bonds between the slaves and our protagonist. It has actual plot. Even though it feels slow the author still manages to make it quite good actually (for me at least).I never really think myself the type of person who would just watch ecchi with little to no good plot. But this, I’ll actually give it a pass. It’s nothing unique really but it does pushes the boundaries of shitty generic isekai protagonist who doesn’t have the balls to lose his virginity.All of the characters are actually useful a lot of times for the sake of the plot.I’ll give it a solid 8/10 which I’m pretty sure I’m biased because of the wholesome waifus I guess. I just would feel bad if I were to give 7/10 lmao.", "You have more iq than the person who last gave a huge review (you can see it if you scroll down a bit, i argued with him)", "I mean not last one who gave a huge review but its there if you scroll more", "Stop reading this cuz the author doesn't make doujins", "No, but the artist does... Just not for this XD", "I dropped this cause this makes me too horny🗿 guess I will start again", "Just another generic isekai manga, keep moving nothing to see here", "... ignorant fool.", "Maybe that's what people want? Also there is sex and author takes time to properly sex them up rather than just putting new waifus into collection which is already better than common isekai harem. Most mc don't even hold hands.", "Wan Syahril Wan Seadey fr, it's like eating those fancy burger, technically you can get one everywhere, but this, is one high quality fancy burger", "dropped this manga for 2 years and now it only has 47 chapters ?welp, gonna drop for the next 3 years then :V", "i nuted in my sleep thinking about lolis", "Bro you're way too horny relax a bit. I see you in every comment section ecchi or not saying that you nute.", "honestly, if i closed my eyes and picked a random manga on the main screen ill prob find u in the comments", "I was gonna read it but I saw Shounen and 5 chapters of \"Never give up\"", "Give it a try, you won't regret it. It's basically Hentai with good plot and it's slow paced.", "If you think it's five chapters of  some kinda dragonballesque long fight, don't worryslight spoiler:it's just MC trying to find a way for one of his girls to unlock the job she wanted but gave up on.", "47 (18.6) Rawhttps://weloma.net/687/49892/", "This is the type of manga that you recommend to your friend who likes to read a good drawing, but not really care about the story. I this the story is not interesting, the MC didn't have any goals in mind and not really showing off either. I'm not saying the story is bad tho, the story is nice, wholesome, and refreshing. All seriousness aside, if you want to be horny or smthng i recommend this, the sex scene is great, at least 7-9 sex schene in this 46 chapter and they all different and nice to read.Overall great manga, maybe on of the best drawing ever 8/10", "the plot is decent, but the \"plot\" is 10/10", "dog dwarf cat dragon and elf", "i type harem out of curiousitylooking for a decent copper mangabut alasi find this gem", "NGL ever since chapter 40Everytime theres an update I always reread this from chapter 1And its so ffcckking wholesome", "https://manganelo.com/manga/hz921236 try this manga, honestly one of the best I've read in a long time, if u want the mc to be smart, and think through and solve problems, this is it, good character development, wholesome, and just well written. You won't regret it. 10/10.", "Honestly thank you so much, that was one of the best manga I've read in a long while, for some reason I wouldn't say every aspect was the very best, but everything was a 9/10 making it as a whole a 10/10", "Anesu Mashiri 10/10 in isekai/ fantasy manga standards.", "Progression is too slow, if any. The world is interesting if you have low standards. Too much s*x, why is it not just h*ntai at this point? It wants to be a 'slice of life' so bad, but it's designed like an adventure. Those two genres are practically water and oil.", "Its as if you dont consider adventurers as proper jobs. And no shit sherlock it is INDEED a damm adventure manga (seems like  idiots still dont read tags these days) but is progressing slowly because thats what we CAME for. If you want those bitchy ass cliche ass mangas where mc is overkill my ass op and is a fucking hero and tries to hide it while one shoting a fucking demon lord, then go back there idiot. Keep your delusions of being a hero, while we stay here and read what we might actually do if we get isekaid.i pray that you regain some brain cells after you enjoyed that boku no pico shit and learn to read fucking tags and stop denying you fapped to this wonderful masterpiece", "And it seems you havent seen those \"former hero\" tropes where it legit slow life and adventure combined", "Bitch it doesnt even have slice of life tag here mate or am i blind?", "Title: Never Give UpMe: youtube.com/watch?v=dQw4w9WgXcQ", "thought the same", "Guys this manga is fucking wholesome, it's like Slice of Life, Isekai version. For now they still have no main goal, like killing Demon king stuff, give it a read.", "Jay Parkash Dubey I will include ONLY! you are not my mother to be ordering me around mister", "Monzer W Jaouhari lol it realy kills you, when your stuck with your family for a whole year with no way out", "this is soo gooood I wish I can find more of this", "nooooooooooooooooooooooooooooooooooooooooooooooooooooothis a harem so roxanne will have less screen time when his harem gets big nooooooooooooooooooooooooooooooooooooooooooooooooooooo roxanne best girl :(", "roxanne is number one no matter how many slaves he gets and you will get to love every member of the harem, trust me", "I feel bad for the people who drop this :((This harem manga is really great... The girls too and the bed and bath scene 😏 and there will be anime soon...", "Those ppl are just gae", "Meh, it was great atm but in the future after the third and fourth girl the writing falls off.", "Anna Nishikinomiya or they just dont like rape", "Alright! Let's play our favorite game! I see the Harem tag. Now we read a few chapters and see if this is as bad as a harem should be. I will be back after a few chapters.EDIT:It actually happened. I read this once to a certain extend and totally forgot about it...But i was right none the less. MC-Other world-OP-Harem.The only good storys with harem tags are those where the harem tag is not to be taken seriously. Harem=bad story.", "At least the mc is not a pussy. It doesn't have any good nor bad plot just your average one but it's perfectly balanced with holy scenes and the plot.", "I bet you didnt even go beyond chapter 6. nothing in the story matches what you just said. hes not even that op and he knows it. He just has more opportunities than everyone else, where the hell did you get the idea he was op? Your oddly narrowminded, you cant even seem to tell the difference between this and your average harem isekai manga.", "Pretty good manga with great art and interesting world...as long as you don't mind some soft core hentai as a bonus", "ohh i see tachibana omina art style/", "damm author-san  ran out of title names and decided to rick roll us", "better chapter name", "bruh", "best manga of all time recommendedWww.mangatoread.comONLYplease don't include ONLY", "Once a month update sucks for real. This is a really good comic.", "\"comic\" lmao", "Comic?", "Does anyone have links for the novel???? Pretty please !!!", "Question for those that have read both light and web novels, is the progression speed the same?", "anybody know other manga or anything with the artist? or author?", "With the artist? There's plenty on the hentai side... He IS a hentai artist after all.", "Silver Nightbane whats the artists name", "Mega Bannana after some cultured research, checking the wikis and other shits, i got the result, here is one of the artist's code that i found: 327561", "My prediction say it will be updated this week", "600/10 love it", "and the novel its priceless ! read it dude!", "i love it, its really heart worming surprisingly", "who said he*tai can't be wholesome and have good plot", "trash", "Isekai, HaremYeah, it's that easy to be happy", "lmao", "Something similar to this please", "Damn I was gonna read it then I saw harem..bruh..", "It has harem in the title..........", "Sum Umm i think that's what he meant", "10/10 i just hope the harem doesn't get to big i like roxy", "only 2 more 1cat and elf", "Why tf this got so good rating", "The manga really explore how the world around MC works instead of focusing on the harem alone and that's a big score", "Can someone please recommend mo more of this type of isekai manga", "This is great tho. Also this will be awesome because there's a anime adapt this year.", "Ohhh now I'm interested", "10/10 in my opinion", "It IS reeeeeeeeaaly good!!", "Before you read this manga i want to remind u guys that this manga gonna have anime adaptation so its better for  to watch it cause this is a very good manga...", "What's the anime adaptation?", "You mean hentai adaptation", "Federico Muller  if redo of a healer got a damn \"anime\" then this i hope will get one cuz redo of a healer is shit, but this is actually really good", "Sometimes its questionable but all right i guess", "What do you think the condition for unlocking Master Blacksmith is?I'd guess, level 10 villager and/or explorer + defeat an enemy using a hammer.", "If I remember correctly it was Villager Lv.5 and she had to beat two monsters barehand", "Angelo Melpignano it should have been hit two enemies in one swing of the hammer and villager lvl5, explorer lvl 5", "So basically a man accidentally visit a CYOA's site and choose the good ones.", "I basically make about $6,000-$8,000 a month online. It’s enough to comfortably replace my old jobs income, especially considering I only work about 10-13 hours a week from home. I was amazed how easy it was after I tried it. start earning more cash online just by follow instructions here........Www.Jobapp1.ComONLYplease don't include ONLY", "Not too bad", "the tags are a true sign of a shitty isekai", "Sori Na except you shouldn’t judge a book by its cover and tags, its pretty good for a isekai harem manga, dude gets laid, theres no “hero of the world” and hopefully there wont, and the plot is them going on their day going on adventures instead of destroying the demon lord or something", "@phil douglas  that's why ive been thinking twice before reading the ecchi harem combo is ingredient for shit stories.", "this lucky bastard", "I though this would be another isekai story with either countless sex scenes and no story or an isekai story where the mc is a dense overpower insufferable moron who doesn't ever get the hint, but I was suprised. This actually has a normal mc that is actually a bit realistic and the story isn't bad at all. I will definitely watch the anime when it releases.", "People this isn't a hentai. XD The manga adds more than the LNs have in it. Probably did so the manga would sell well.", "Before reading this manga, I thought that it is some sort of hentai with a little bit of isekai story to glue sex scenes together but I was completely wrong. Even if you remove all ecchi stuff and just leave some hints about what has happened in the bed, it would still be a very nice satisfying wholesome peace of entertainment.Ecchi stuff is made really well right on the border of hentai. No actual depictions of sexual organs but still enough to show what is going on, lots of feelings and foreplay.The main character is a very rare example of realistic male human being. He is not an idiot, he…See more", "http://www.isekaimaker.com/ here is the link for the link he clicked", "this is hentai but I think its good becoz the storyline is good and everything make sense. Its 100 time better than those overated manga that use heal to reverse time of the world and have sex to gain power which doesnt make sense at all...", "But it still got animated , I hope they omit the village part , too fuk up.", "bro you sure do have a lot of anger on that manga 🤣", "i think i know that manga ..", "this is unfair for other isekai mc, he go to isekai by just clicking a link without meeting with truck kun", "To all of you horny bastards, it's really damn fucking good to read. Just read it already and don't think too much dwindling whether to read or not. Just. Fucking. Go!!!", "First 10 chapters might be boring for most of you. Buuutt, right after that chapter 10, the fun starts there👏", "No sh*t", "Can you please tell me how to contact above service", "11/10 this is good shit, hentai with godly art and good fking plot definately gonna reread it", "and what do they mean by anime ? lol hentai? i mean if they try to make an anime it will be the same thing that happened with interspeicies revieweres", "this is hentai and is a manga at the same time", "any numbers for this ?", "no code for u", "just get through few chapters and if you are ok with sex scenes this manga is one of the best", "Couldn't agree more, one of the best and respect to the artist nice details but the translator censored it in few chaps", "Story 8/10Art. 10/10The MC is not a pussyU have to survive 10 chaptersAnd then it well get goodIt's basically hentai", "i think its good without the need to survive until 10", "The most beautiful isekai art, slowly but interesting slice of life/dungeon crawling story, cute as fuck heroine and extremely vanilla detailed wholesome sex...What more can a man ask for?", "agree 100%", "If the anime takes out the sex scenes, it'll be just like the web comic, which wasnt that great.", "Is the same studio that is making redo of a healer doing this as an anime too", "Seriously I like them but idk these are getting an anime", "Vidal Dai Ron Japan wants more serious stuff. Especially since the west is trying to censor there stuff. Which they can't stand in general. Might get to a point where some anime don't make it over here at all. Which has happened before back in the 90s.", "Here is a review from me;So far it has been a ride in which we experince the rise of a hero that been stabilized by desired. In my opinion the fact this managa differs from tradional harem,and love stories elevates it. I enjoy how detail the emotional toll of every character is hightly describe, The fact that there isn't a defenitive goal like returning home or defeating the demon king, it allows for more time to explore the characters, If I were to complain of something it will be the labirith, so far no explanation of what they are how they work or the role they play in this world has been …See more", "Comments are full of goblins, I just wanted to make sure that there was no NTR and that it wasn't too lewd with actual plot development but legit all I see is people talking about s** scenes....... smh this is why humans are gross.", "Shut up and read it. There isnt ntr and this is as wholesome as it gets", "it's called \"sex\" and it isn't innapropriate or gross. The tag states \"ecchi\" wdym too lewd? If mere comments cause you panic and stroke just dont fucking read mangas that's tagged with ecchi.", "I see Ecchi, I stay", "Love this ecchi manga. Please release more often. This is truly what people will do if they go isekai.This manga has very good drawing. Love this manga. Love ❤️ this studio.please release more often.", "Read the title and I instantly go uninterested", "Go elsewhere and do shit talk bastard", "This manga is surely good and appreciate for ecchi fans", "every time this mange get updated and have a ecchi scene,im also commiting genocide.", "Most chilled hero every summoned or reincarnated he has no problem with anything travelled to another world killed some chill monster bought 1 chill slave made some chill rules like morning kiss wash back of eachother full day hunting or roaming in town at night sex and sleep bought another chill slave make her follow same rules got sex maniac skill no tsundere kundere yandere drama super chilled story", "This is getting an anime BULLSHIT how are they gonna do the sex scenes or will it be by the same studio who will be doing redo of healer this season because i for the life of me still can't understand how thse series's are getting greenlit", "This will not come in anime.if it comes all the sex scenes will be removed. So chill.", "Technically there is an \"anime\" is called Overflow, so yeah why not?", "can you hear it? Yes it will happen to you when you read this", "god tier manga, the art is really something else, and the sex scenes are really well done. Ive reread this 4 times.", "yas, it majes you reread it over and over", "No offense but why not just read hentai?", "Jsgsvw Shai Ahwuqih cuz story and no straight 100% sex only", "only slave 1 (roxane) and slave 2 (sherry) in manga? hmm.... spoiler. . . .michio intend to make party (6 people) with his slave... soo we got more in future...this story getting more interesting when....slave 2 (sherry) got master smith job... she very smart too... slave 3 (miria) also got nice move when she got assasin job…See more", "All thanks to slave trader that reserved best of the best for mc onlyand yeah some how mc is hardworking,kind and kinky with high morale valuesthus well deserving", "For a lewd manga the scenes and art are something else..", "Is it lewd manga tho? I mean I find it kind of boring, kind of like a life itself. You work, you have sex and you do whatever. Not some virgin with a cat girls killing the demon lord 24/7...", "Josef Riegl if you are talking about Sato from \"Death March\" then you are wrong he has an excessive sexual life but he only f*ck prostitutes because he don't like taking responsibility.", "Welp both the above comments are gross, like 1 if that's life for you than that's just sad like get a hobby and what about eating why do just work and gave s** that's depraved. With 2 I rather think he just visited the filth house once then stopped cause the others were disappointed in the fact that he would visit such a place...... like why do I see so many people that comment on this site that act like goblins.....", "I don't see how they can pull off an anime with this... it's just much of the same over and over", "I mean the art is really lewd... Unlike other manga that have s*x scene... And this one is really God tire... I read it over and over like 10 time already", "I love her expression...", "didnt you watch Ishukaku Reviewers? thats how you make an anime from a manga like this one", "I hope they don't skip the bath scene and s*x scene...", "Its all over the same contents and it repeats in a cycle again and again novel too.", "so, They won't skip it cuz its the plot.", "Aravind BL i think they just made uncensored or censored", "Got anime adaptation news and immediately came here", "WAT??? REALLY????????I'VE BEEN READING THIS FOR OVER A YEAR!AAAAAAAAAAAAAAAAAAAAAAAAAA", "This is a Dream come true, finally getting anime adaptation, i nevera expectativas this be animated", "The Anime will be in 2021. I guess I will find it in Chruncyroll and Hanime 😂", "This is getting anime aduptation in 2021...so will it be called anime or Hentai ??or rather hentai with Some good plot...", "I wouldn't mind it being a hentai", "Remember how was Ishuzoku reviewers?", "This is really bad, it's just cliche isekai harem manga and a bad one at that, this guy transmigrated from our world as a normal person and he starts killing people like it's nothing, and even after realizing that he killed people for real he just shrugs it off like it's not his business. Also, it's pathetic how he instantly got obsessed with a slave girl he knew nothing about, someone he met for the first time, yep that's his motivation to get stronger so you can see how pathetic this mc is, he didn't bother trying to learn anything about this new world he got sucked in, he just wants to buy a slave girl and fk, sure he has sex but the plot is shit so you might as well read hentai if that's what you want.", "It reads like you haven't read the manga. He starts killing like nothing because he thought it was a game at first. You would know if you read the first chapter. Don't act like you would hesitate to kill people if you thought it was just a game. He did have regrets about the deaths after he found out the world was real. But he realized he can't dwell on it forever and moved on. It is actually a pretty admirable feat. And he's constantly experimenting with new things in the labyrinth, trying to figure out the system. You wouldn't know since you probably haven't gotten past the first 5 chapters. His motivation for getting stronger I'm sure is so he can have a stable income and live the comfortable life he has right now with the girl(s) he love.", "Ricky Hong it reads like u haven't read?", "agreed", "Does this update monthly? How long till the ending? Just don't want to start a manga that has no end in sight atm.", "It's still being published so there's no ending in sight.", "it's kinda slice of life manga", "One of the few rare harem manga where the MC actually does the \"deeds\". Not like other harem MC where they act like they never see a women or worse cockblocking themself.", "Parallel paradise", "Madia Samu Thats why he said one of the few..", "Tikus Got lmao", "bro where is the adult tag llike damn brooo", "Finally, an update!", "Like all japanese manga, its once-a-month updating.", "This series is pretty much similar to Desumachi. Both Slice of Life(Main genre of this series) Both have cheat ability(though Satou Pendragon is more powerful)A bunch of slave as companionThe only difference between this two is that Satou Pendragon is not a Lolicon and he doesn't touch his girl companions(but he do sex on brothels) while this one MC is doing sex every now and then. well both story is good anyway.", "You basically just described the slow isekai subgenre :) But yeah, Death March is one of the most template slow isekai stories out there, and it's damn fine at what it does (full WN and 21 LN volumes and ongoing). This one is much simpler, when it comes to story and world building, and it concentrates more on the harem side of things, but the art it great, defenitely NSFW though.It's hard to find something like Death March, it does a great job of merging the slice of life with adventure, while most stories usually lean towards one of the two, but here are some other isekai I find worth recom…See more", "Krzysztof Kanigowski damn bro thanks a lot...", "Stephene William Antonio the anime skipped the detail about him go to brothel but now i know why he was at that bar place...", "It's good and ecchi scene are the best", "Does anyone know where if you can buy this manga in English?", "It is not being sold in English.", "umm tecnnically i cant believe its not a doujin not hentai noob", "Alex Paz You don't know what you're talking about.\"Doujinshi are simply fan produced manga, often using famous anime characters from anime TV series or major professional manga. Most of the time the doujinshi that make it into the hands of Western collectors are pornographic fan produced “homage” to favorite anime series, but not all doujinshi are pornographic.\"Hentai is porn.", "Alex Paz ahaha normies", "This is not Christian... But still gotta read it for the plot I came looking for isekai,and stay for the PLOT and the plot.Warning:\" This is not just your ordinary isekai this is a Adult Hentai Harem Isekai Manga \"---IF you don't like harem clichies, female slavery ordered to please master and hentai scenes Then this story is not for you--My Review:\"Art is very well drawn and detailed so expect Nipples to be shown.\"This is a well executed slice of life Isekai Story it is Slow and the Right Pace not fast paced because it gives you every detail there is to this fantasy world,I always like …See more", "Mohamed Desokey Thank you so much for that detailed info on this.. will make sure to write it on my list to read..!! Stay safe dude...!!", "I came here to write a good review on this, but I guess you took my place this time, respect", "5 star", "I gotta say roxxane is SSS-tier she's way way way way way WAY better than most anime waifus", "99+/10 very good read, recomend!!", "Not a Good Read in November.. but continue if your feeling brave and in controle.. <_<", "I accept the challenge ._.", "Záīñül Ábîdëēñ aaaaand you lose in nnn just like me", "bet", "This is the real definition of slow life manga ,not a fake like all of those slow life isekai manga where mc keep finding trouble for himself", "You look badass mc who heartless and cold you might like this manga and if  your into post apocalyptic and cyberpunk", "This good recommendation 🔥🔥", "bruh, solid gold... thanks for the rec.", "If you're looking for an erotic yet wholesome manga, you've come to the right place ;)", "this is bad, it's near NNN for november.", "It's lewd but i like it (˵ ͡° ͜ʖ ͡°˵)", "One of the best to me..thumb up", "So this is pretty indecent? sorry but i was here for the plot not for romance, harem, action or whatever shit, i don't care whatever genre i read, but i place importance on plot and looking at the comments down below, i don't think i will find what i'm looking for here", "Another bot or fake talking high and mighty..what a fucking asshole", "Im not sure what u expected it literally has harem in the name? Like tf", "You must be all kinds of dumb , the point of this Manga is just a guy enjoying his reincarnation and doing what he has to live a good life ,he doesnt seek glory or justice he just wants a good harem and to live comfortably. So if it aint to your supperior taste", "The action is very good especially at \"NIGHT\"⁄(⁄ ⁄•⁄ω⁄•⁄ ⁄)⁄", "I have the power of god and anime on my side", "Bro WTF!!!!", "Here strangerYou will need this", "Sorry bruh that's not necessary even if my partner down there makes a fuss about this i won't do it because I'm trying not to kill my own flesh and nutrient. So I'm good to go", "Thank you", "Finally harem protagonist with the mindset of an hentai protagonist.", "ur profile pic makes it better", "\"Harem\"Me: so that was a fucking lie noice", "just wait till he gets 5 slaves", "Joshua Nisay true", "40", "This Manga Kinda disappoint me the Only thing good here is the sex scenes between the Mc and fmc the whole story very Bland for me😑😕", "Are you sure about that?", "Please don't talk shit here Ryner Bytes", "Zaf Ran He's not wrong, though. Plotwise, MC has no agency, so barely anything happens. The first few chapters were interesting because he needed to gather X amount of money to acquire Roxanne by Day Y. However, after that... it becomes extremely decompressed storytelling. Slice-of-life storytelling, where the MC isn't motivated to be proactive, nor does things happen that would compel him to act. And that strange because he's a stranger in a new world, but he puts the burden of his knowledge deficiencies onto Roxanne and tacitly ignores doing anything for himself. He might seem to care about …See more", "No chapter for this month 😿", "upload more please :(", "i need more like this", "Need more plz... I want my roxy fix", "This manga is.............…See more", "That's more than enough reason to read it!!", "guys any recommendation for manhua, manhwa, manga like this..??", "there are a lot, i recommend parallel paradise", "Manuel Perez dude your recommendation is too much for ne to take, but thanks tho, any other recommendation??", "Hafizh Dhaifan Thirafi  kekkon yubiwa monogatari, try it", "Imma be honest, have not read yet but just based on description I can almost tell it’s gonna be a banger", "Good dayPlease prepare for 7-10 yrs from nowAs a disturbance will cause a change in the world.", "Warning:\" This is not just your ordinary isekai this is a Adult Hentai Harem Isekai Manga \"---IF you don't like harem clichies, female slavery ordered to please master and hentai scenes Then this story is not for you--My Review:\"Art is very well drawn and detailed so expect Nipples to be shown.\"This is a well executed slice of life Isekai Story it is Slow and the Right Pace not fast paced because it gives you every detail there is to this fantasy world,I always like these type of slow and Slice of life Isekai's because it brings you more depth about the world.Most importantly this has go…See more", "Sasuke", "Jacob Dan Yet I don't understand why they changed him so much smh", "I read until chapter 40 (released so far).If I were to summarize my opinion about this manga in one line, it would be:\"Not worth reading\"The MC is not bad, since he doesn't go around hurting \"innocents\" for his own gain, but he is also not good either, since he watched a woman be Gang Raped and he was not affected (he just found it unsightly).I wouldn't normally have a problem with an MC who cares only for himself, but the problem is that he has no drive. No greater goal so to speak.This manga shoots to many sides but does not hit any, except the art, which I have to admit is first cla…See more", "Dont listen to this guy..... you should try to read it.", "Just go for it..... Dont just drop cause of this narrow minded comment", "I completely agree, and I'll add: it's incredible the amount of explanations given by the mc to us that is absolutely worthless, be it for it's lack of depth on the subject at hand, or because the information is plain useless.Like, oh, if you use a staff instead of a wand, you may produce slightly stronger magic? Who gives a rat's ass?If your sword gets stolen, you lose like 60 mysterious points? What the heck are you talking about?You purchased a sword with a skill slot that you're not going to use in 40 chapters? Wow, thanks for the info, dude. You could have bought it when you can put…See more", "The light novel stopped for a long time around 220.can anyone tell me where can i read the rest?? Or it stopped?", "Sauce is Jitsu wa Ore, Saikyou deshita?", "Yes finally a new chapter", "I kind of want anime adaptation if goblin Slayer got one and Kaifuku Jutsushi No Yarinaoshi getting anime adaptation.Let not forget Interspecies reviewer anime.", "Seriously? Kaifuku is getting an anime? I agree with the guy above me, it's cringe as all hell.", "i wish the earlyer chapters tension would come back, the MC having to be carefull of the bandits when he was trying to buy Roxanne was cool", "I miss the time when protagonist-kun almost died at the hands(?) of a f*cking tree. That was some high tension shit.", "I need moar T__T", "thY for the chaps. >.<`", "And here i am still waiting for the chapter 40", "10/10 really good shit. MC isn't a fucking wussy and his slave if also a cute badass slave really awesome plot recommend to read it", "when you will get the 40 ch? is already in raw", "You’ll read a decent story and get a good nut", "this is some goooooooood shit", "Gonna bookmark for now", "Were missing a genre Here,  i almost didn't find it... the heck of thise kiss..site", "tdaa tdaa", "plot takes forever to happen tho", "Eulyses Reyes Corpuz the god didn't really give him anything to do, so it's just based around a guy living in an isekai life. No standard start up of \"You have to kill the demon king!\"", "Eulyses Reyes Corpuz - It’s called “plot development”. Good writers won’t rush it, and this one is taking time to both develop the world and the characters. I personally prefer it to stories that rush through shit in the first 15~20 chapters.", "For those wondering if it got ntr DON'T WORRY MY COMRADES IT'S 100% GOOD SHIT VANILLA. STAY SAFE", "How dare they even dare say the N in NTR near our goddess Roxanne?", "NTR schmucks must die.", "The 1st chapters are quite confusing and have a thought of dropping it but after getting roxanne the story focuses on the romance,dungeons, earning levels then starting a new life the h scenes are good and the character development, flow of the story are nicely progressing the good thing is the story doesn't focuses on harem it took 37 chapters before, getting a new plaything", "I hope this continues to get better. I seriously thought that this was a bad isekai becase of the start", "I hope there's no ntr shit! ....here I go ....wish me luck", "No ntr dude. Chill.", "That was fast", "The isekai tag got isekai'd.", "And We know whos fault that is!", "Bernard MC Gowen I think truck-kun is already disappearing from the front lines", "Bernard MC Gowen no ntr right?", "I usually dislike Isekais but this is ok(maybe Im just in a good mood idk)The PLOT is amazing", "I recommend you- Sex and Dungeon", "Where is the isekai tag?", "Need sherry 3", "Need more of this kind", "Any recommendations for similar manga?", "If you're looking for good isekais, these are my favourites:\"4 Cut Hero\", really funny.\"Buta Koushaku ni Tensei Shitakara, Kondo wa Kimi ni Suki to Iitai\", i believe is quite good. There's no ecchi, tho.\"Dungeon Nursery\", wholesome manga. Good mc, really funny history.\"Konjiki No Moji Tsukai - Yuusha Yonin Ni Makikomareta Unique Cheat\", quite generic, but good. Good ecchi, good action, good history.\"Mushoku Tensei - Isekai Ittara Honki Dasu\", not a bad pick. The history's gone quite far.\"Nukenai Seiken-chan\", good ecchi, good history.\"The Hero is Overpowered but Overly Cautious\", quite funny.\"Time Stop Brave\", only 6 chapters so far, but quite good. The mc is a funny chad.\"Yuusha to Maou no Love Come\", quite funny.", "Mega Mega there's a lot of ecchi lolicon suggestions in there... So you don't like adult curvy women but rather little girls...", "John Keeth and what’s wrong with that? I see that you’re lacking in your man of culture lessons", "Remember when the mc almost died in the hands of a lv 1 tree? Good times, man...", "so far MC added two fine pieces to his collection... hopefully it'll grow into a diverse \"bevy\".", "Oh, a new bitch to say \"Sugoi, master-kun!\". Such a brave new step for this manga! Any other writer would make it so, I don't know, something happens, but no, new bitch it is.", "SO GOOOOOOOOOOOOOOOOOOOOOOD. I've read 20-30 isekais by now and this is going straight to top 2. The story progresses slowly which is a good thing unlike many other isekais. And the mc was about to commit suicide so he probaly doesn't have many attachments to Japan so he wouldn't be foolishly searching for a way to go back. In alot of other isekais the mcs's past is just normal but suddenly you can use alchemy and science like wtf??? But in this manga we don't know ANYTHING about the mc's past and we get to understand his personality overtime. And he's not a prodigy in either human emotion or in the brains but he's above average. He also grasped that this world's common sense doesn't work like his old world and slowly tries to adapt to it. For the art, it has this kind of mysterious but comfortable aura to it. I'd give this manga full marks 100/100. It's a rare find.", "also -best part- MC makes the first move (yes, i too was surprised to know that girls don't actually come chasing u out of nowhere and cause excessive nosebleed)", "Yeah, a lot of isekais are really crappy. This one in particular is really bad. Take out all the ecchi/hentai and the result is a manga nobody would want. We are at chapter 38 and literally nothing worth noting has happened yet.The pace, as you say, is extreeeeeemelly slow. If it went slower, it would just stop.The only place where I can find that the mc wanted to kill himself is in the manga description (and maybe in a thow-away line), so props for that.\"To be searching for a way to go back is foolishly\" most isekais give their mc this motivation because it's the most basic and generic mot…See more", "Mega Mega You really don't like the story, I for one do. If you don't like it then don't read it. Throwing a fit on the internet will solve nothing because at the end of the day it's your issue and yours alone.", "Link for the novel pls... thnx", ".......???...........what ?...............WHAT ?.................WHAAAAAAAAAAAAAT?!!!!!!!!!!!!!!!!!!!! I WAIT 2 YEARS FOR THIS !!!!!!!!!!!! THE NOVEL IS ALREADY FORSAKEN !!!!!!!!!!!!!!!! YES, YES, YEEEEEEEEEEEEES !!!!!!!!!!!!!! HELL YES MY BROTHERS !!!!!!!!!!!!!!!!", "This has a novel? Thanks for telling me, have dog", "Eat Pant thank you, you're a good man.", "Eat Pant https://www.readlightnovel.org/slave-harem-in-the...", "Wow its updating fast! Please keep it up", "They just let it slide for a bit and are now catching up.It‘ll slow down to once every 2 weeks soon.", "this is some good delicous shit", "WHAT? The manga that has \"Harem\" in the title has needeed only 38+ chapters to have a harem of just two women? Such lightspeed!", "hahahaha you fool ! is just the beginning !!! he have:1 dogskin (you already know)1 catskin (love fish, became slave because of fish........she is idiot)1 dwark (like loli, love book and alcool)1 dragonskin (huge breasts ,dark skin, tallness, have muscle, but shy)1 elf (slave for a period of time but the guy doesn't give a sheet and just fuck...............she is noble and not just any noblehe has a house, (with a large bathtub............you know what i said hahaha)", "Jules Wild I can't wait for the chapter 200 to finish this line-up!", "Thank you for 2 chapters in a row", "Is it daily update now? If so, I don't think my little buddy here can calm down", "don't scroll down the comments. nothing meaningful. if you're here to see if it's good or not i'm gona give MY opinion after reading it.", "welp, the story is somewhat slow paste but what makes this one stand out (out of millions of other isekais) is that it 1- doesn't have exaggerated reactions when the MC can't handle his feelings. 2- this horny bastard knows his priorities, and didn't wait for chicks to start chacing him but (believe it or not) made the first move. other than that i'm only a couple of chapters in but i find the story decent so far. although it won't neccessarily be ur \"cup of tea\" but it's not a complete waste of time reading it.", "English Translation:Drink Breasts?..Sorry for low level translation...This is a Very Well Famous Dialogue by Dipzoll(the guy you see in the pic) of Bangladesh...", "🎵Roxanne Roxanne all she want to do is party all night God damn God damn🎵", "This is just a doujin hentai, just focus on sex", "It must be my birthday; three chapters in one month? Hell yeah.", "3 chapters this month, so happy", "If i were horny, i had gone to nhentai instead not stay here to read this shit", "This is bad and literally just hentai, wasted my time", "Can we just be done with the common trope of isekai protagonists buying a slave at the very beginning? It's always disgusting and rarely if ever good. It's basically a \"what if I could have a pretty girl who has to do whatever I say\" fantasy. Yeah you're a great guy because you didn't fuck her right away, nevermind the fact you're still buying and selling a person. In actuality it's really just a lame excuse why a woman would be traveling with the MC without having to go to the trouble of establishing anything. Great job for being lazy, A+! Fuck, I hate this trope.", "---- > https://jezebel.com/ wrong site kiddo", "Bro....... remember the times when u could buy slaves? Yup you r probably related to themSomethings were normal once that r not considered normal anymoreSometimes ppl even chose to remain in slaveryDon't go imposing your thoughts on everyone elseAlso i hate the idea of slavery as well", "Biĺĺi Ŕàđ Bro... remember the times when people you r probably related to sold their own people to people that looked like him? And meanwhile remember when people he's probably related to fought and died to freed them?The past is the past. We are in the present. Grow up, dude.", "Just for you guys, the mangaka name is \"Hyouju Issei\", Sogano Saichi is the scenarist >w> ! I say that, because, Hyouju Issei did other works, the kind of works with number like: 241733", "What does The nr. Mean?", "David Lorentzon go to Nhentai. net and type it in", "Olivier Trainki god bless you", "Spoiler alert.......Ntr coming on roxxane, ready for heart breaks", "u didnt even try to hide it properly lmao", "Number 1: wtfNumber 2: Who what when where howNumber 3: Sauce?", "Shahzad Shahzad ops", "just y'all wait for more slaves", "The art, romance and fanservice -10/10The plot is slow as it's based on the light novel but it's really sweet like i read 29 chapters in one sitting and boy did have I ever enjoyed a couple so much", "Suggest me more manga like this plz", "I only read a few episodes but deathmarch is almost the same", "Seichou Cheat De Nandemo Dekiru You Ni Natta Ga, Mushoku Dake Wa Yamerarenai You Desubut no sex scenes", "Daniel Onofre no not same", "any other manga like this?", "Seichou Cheat De Nandemo Dekiru You Ni Natta Ga, Mushoku Dake Wa Yamerarenai You Desubut no sex scenes", "Where is harem? I don't mind that he is alone with her whole time, but this tag is a lie.", "the harem builds up soon, its based off of the light novel of the same name so they havent gotten to that part yet", "5 star and bookmark", "Does anyone know a similar manga like this?", "there's this one but it hasn't updated since january. https://manganelo.com/.../seichou_cheat_de_nandemo_dekiru...", "Steve Simpson thank you 👍", "33", "38", "If I meet God I am asking to have this life. That seems like the kind of fun I'm looking for.", "10/10 romance10/10 art10/10 fanservice9/10 barely op MC7/10 wholesome7/10 storyDon't read this if you don't like a slow and steady story. MC is at first a simp, but redeems himself by becoming a chad.", "This is not Christian... But still gotta read it for the plot", "An author who understands the supreme value of foreplay.", "yep, i agree. even most doujin i read doesn't have enough foreplay. The author really have 'experience' 🤭", "I need me a roxanne in my life", "Yeahh everyone watch this manga got \"Need roxanne sydrome\" and furries too", "Still good art, but author is really padding out the storyline with ero chapters at this point.", "The art is great and the way the author build each scene it's gorgeous. If it were you, wouldn't spend a lot of time with Roxanne? I would.", "Level 1 dungeon shit and te rest is furries", "Ero levels are good", "This one's nice I like the sex scenes too 💀", "whens the next update", "Nofap time", "I'm having a severe case of \"lack of Roxanne\" already... WHEN IS THE UPDATEEEE", "Warning:\" This is not just your ordinary isekai this is a Adult Hentai Harem Isekai Manga \"---IF you don't like harem clichies, female slavery ordered to please master and hentai scenes Then this story is not for you-- My Review:\"Art is very well drawn and detailed so expect Nipples to be shown.\"This is a well executed  slice of life Isekai Story it is Slow and the Right Pace not fast paced because it gives you every detail there is to this fantasy world,I always like these type of slow and Slice of life Isekai's because it brings you more depth about the world. Most  importantly this ha…See more", "Good review, but one error: the second one is dwarf not elf.", "is there any manga like this adult isekai ? if u know some god shit", "ABraham Ali Aliyev you asked the right being fellow reader here i all the fap materials i read-Redo of The Healer-Parallel Paradise-When I Was Playing Eroge with VR I Was Reincarnated in a Different World-Sex and Dungeoun-Butsuri san De Musoi Shitera Motome Ni Narimashita-Silent War-The World that I rule -Brawling Go-Sweet Guy…See more", "Gotta love Roxanne👌", "New Server,We are updating Isekai Meikyuu De Harem Ohttps://mangallama.com/manga.php...", "New Server,We are updating Isekai Meikyuu De Harem Ohttps://www.mangallama.com/manga.php...", "Any recommendations for this type of isekai manga", "HmmmmmmmParallel Paradise?", "Manganelo it's quite fun as a site. Even tough i love this page, sometimes make's me hate it. U would be asking, Why? Well, it seems, that they dont control or care if the manga's published here are either well uploaded, or even if all the pages are on. If you really like this manga, i want you to know guys that you are missing the 1 chapter. Yup. It happend, that yesterday the web was down, and i couldnt read nothing. So to carry on with the manga i was reading, i found another web. Im not gonna do any pub about other webs here, mostly, bcs i only 1 this one and another. Still, im gonna put …See more", "John Smith i agree.i plan on buying as soon as i can but as of rn i both dont have the means to pay or the access(im still a kid).i plan on getting them once i older", "this manga is too sweet that i need to take an insulin every chapter", "Rape shit.....", "Actually no.", "It’s not", "Boonyarit Hongsawat true the good old Story of buying a Slave fuck her on the very first occation but then it happens, ur amzing cock made her fall for u and she really enjoyes having sex, the very first time and that with a total stranger.", "So far this Manga is doing Justice Justice for Culturred man", "Is this even a harem? Like it’s only one guy or one girl in the relationship.", "yah the title might be misleading, but somehow I'm relieved cuz i'm getting tired of harem genres xD", "**Spoilers**-----------------Hes made a few comments throughout the manga about adding new members and Roxxane aggreing to it. If it follows the novel his harem will start to grow (this dude has like one of the best harems ive seen), But the novel is very slow paced so it might take a bit.", "Boy you better chose some over powered skills", "He can't... skills comes with jobs. and he did best taking overpowered weapon wence he can be over at low levels ^_^", "Next chapter is out... the guy with the most quantity of fetish :v this guy got a fetish over a sneeze if he fell like it :v", "This one updates a bit slow it seems. I really hope it keeps updating.", "It's not really slow, about 1 a month is normal. You only tened to get them faster when the trasnlater is playing catchup, and form what I've seen were up to date now!", "The guy feels like the young me in another world, though a bit nicer and less paranoid. The way he acts is very realistic, all through the story he does things anyone that got pulled into an Isekai situation would do. The only thing lacking is that the Slice of Life is bit weird... It is Slice of Life story, there isn't any a greater goal like killing the demon king or saving the world, he is just living his life as a normal inhabitant of the world he is now part of.The only thing that I can find to bitch about is how much focus is on the Game's system, the relationship between MC and Heroine…See more", "Allen Terry I liked your comment little guy. Wanting to be an internet bully huh? What a great future you have.", "Bro,why \"Mc Defeating the Demon King\" would be great?It'll be much better if Mc himself becomes Demon King and do some Unique Shit.", "Satoru Suzuki Name three Isekai manga with more than 20 chapters that actually focuses on the war front of the fight against the demon king. You can't.Name ten isekai manga that has MC going 'I am going to live my life wasting the super powers given to me for LITERALLY *dying*, meanwhile entire towns of people are being slaughtered in other parts of the world, people that I could save easily through the use of my super powers if I simply stopped indulging in my laziness... Nah, lets let the demon king come to me so I can kill him without stepping out of the land I deemed my own. OR if he is …See more", "I just went here because of the suicide summary", "Same. Great minds think alike don't that?", "Bobby Langan yessir", "Bobby Langan same.Why did the others come if not for the suicide description?", "somewhat decent story. great progression (which make the story seem five time better than it actually is.). Easy to understand system though slightly convoluted. MC might not be a coward or a plank, but he's not exactly fun to watch or interesting. He's not BAD, but he's got nothing GOOD either. He's a huge pervert, obv. Too many sex scene. Above avr, but too many. they don't serve anything other than to show a physical oriented relationship. he's got the protag sickness of being too kind... as 90% protagonist do. nothing new there. it doesn't affect the story negatively though so that's a plus. I dropped this a while ago around chapter 24. I just didn't feel anything from the manga then and I still don't 7 month after.", "And Yet you had the nerve to come back and comment here", "My review <29 chapters :Good points :-good story.-good character development and well explained.-Slow but well detailed story.-Good art (verry good).-MC is not a pussy, have some OP skills but it's balanced.-The girl is just too good (I mean all)-MC is not a pussy (...).-Night scenes are WELL detailed.…See more", "helpful and accurate", "honestly bored of the harem cliche. every once in a while you get one that is ok that doesn't focus on it but, most harem stories completely rely on it and abandon any real developement and detail that makes a story good...thx for the helpful review.", "i dont like haram too uterly disgusting", "Is it just on my end or the first chapters got deleted?", "i think its for everyone.Or just us", "May want to work on that description. It is rather generic", "Such an amazing series we need more every month", "why r we getting literally 1 chapter every month?", "It's a monthly manga.", "Jeremy Pielack still better than 1/2 or 1/4 chapter a week", "Mc normal Check.Mc not a pussy CheckMc actually has intimite relationship CheckIts the manga good? hell yea worth reading", "Forgotten? Mc battle junkie- to be confirmed", "it says harem in the title and genre bt i haven't so farstill i dont care abt tat cuz i like tis manga", "Soon, very soon", "Yeah it takes some time till the other waifus start showing up.", "i love slow driven isekai stories, just like a normal man tending to his desires, its quite a ready for me kind of relaxing, slow life in the countryside, same as grimgar of fantasy and ash, living in daily basis of hunting monsters in the same spot for days, which is realistic, teachs you how hard life being in the frontiers where everyone comes and go. i love such mangas and anime.", "If you love slow driven isekais then I recommend \"grimar of ashes and fantasy\"I don't recommend the manga though, horrible art work and only 4 chapters till now. Start with the anime then head on to the light novel", "She is so danm gorgeous it hurts", "this is like a more matured version of \"Growth Cheat ; I've Became Able to Do Anything with My Growth Cheat, but I Can't Seem to Get out of Being Jobless\"", "Anyone here for the way she is drawn lewdly?", "Novel translation link ?", "https://www.readlightnovel.org/slave-harem-in-the...", "Muhammad Irtiza  what chapter is this in light?", "Pretty much like Shield Hero except he fk Raphtalia :) so its perfect for yall mf. Believe me :)))", "Actually it doesn't feel like Shield hero at all, since SH is more dark/edgy type of isekai with revenge plot. This on the other hand is something to a degree of wholesome Slice of life in fantasy world", "Max Colt yea i forgot to exclude that part u mentioned. Except that, it is like SH, or every isekai mangas before :// morning go farming and leveling up, evening go fk :))", "Best Isekai genre.the Main Character growth is normalunlike other isekai, that the MC is absurdly OP from the begining.", "We have smart people👏👏", "I wana read this but how slow the updates are it will be fully dropped at like chapter 50 to70 make me so fing sad", "- Art : 7/10 - Solid- Plot : Let's face it it's an isekai, there ain't much of a plot, but as far as said Isekais go it's fairly decent in this department, 6/10 in isekai plots- PLOT ( ͡° ͜ʖ ͡°) : 9/10 - It pleases the N U T- Characters 7/10 - Fairly interesting MC and the Heroine is a babe, well it's a harem but atleast they're developing the \"main ship\"- Final verdict : in terms of Isekais it's a 7/10 and def worth a read", "At first I was really off put by how he finds OP sword just few minutes in like \"This wouldn't ever happen in actual RPG game\".But then I remembered finding Sword of White Woe literally after playing Morrowind for about 40 minutes. But then again sometimes pre-order bonuses in some games are really game breaking.", "Also Fable where you can clip thru the ground in the starting guild and get the toughest sword right after the tutorialThose little weird exploits are what make old school RPGs imo", "Omar Aouini Well fable is an exploit, while in Morrowind it just rests on top of the cabinet in guard tower", "A morrowind Player? It is an onor Nerevarine", "If you want to read an isekai move on. If you want to read a hentai try it out. This isn't a story, this is slave fetish hentai with too much lead up. Whatever gets your rocks off, I guess.", "I disagree with yuh. This has a pretty good story, with a leveling system i like.", "This manga is good.  Don't mind the dumb comments below. I recommend reading it and if you don't like it then move on. (The rape comments below are dumb asf so dont mind it. BTW I hate rape and netorare in my manga too.)", "No, it's not. This manga doesn't even have a plot. It's probably one of the most generic, bare-bones, themeless, isekai out there. It doesn't have characters.It doesn't have a purpose. It's just porn, don't pretend it's good.", "Eva Jones Eyeah i disgree with yuh. Especially since the LNs has even more to offer. Not only that it solves two problems i see people complain about. Mc is ruthless and he isn't blocked by other characters or the editors. lol", "Jeremy Pielack i got your back buddy.", "The art is just Awsome.. very lovely", "Ch 25 was a rather short one.. *disappointed*", "the best manga that i ever read", "Statistically, that says more about you than the manga 😂😂", "Martin Thomsen There's a lot of good manga out there. But i have to say i like this one as well. Most of the ones i like are isekai and romance/comedies. Very few others outside of those genres.", "Jeremy Pielack Don't get me wrong I like it too, I was very sad when the last scanlation team dropped it and thought it was gonna end.. I just wanted to point out the statistics of what Keir said 😂😂", "Can someone plz recomment me mangas like these one?", "https://manganelo.com/manga/kaifuku_jutsushi_no_yarinaoshi", "Joseph Ernest no it aint. There is no revenge bullshit here. At least not yet.", "Nope Nope Nope yeah their is no revenge but it was still good thank you", "I just would love to see this get an official english release. I want to buy it to support them but can’t.", "the relationship feel more like husbend and wife rather than master and slave. witch is good in my opinion. but, lets continue what will happen next.", "I read novel till chap 130+ and one thing I can say about this...He got more harem, but nothing significant or important happen in the plot so far (Maybe more in th late chap? It has more then 200 chap now) The story just about dungeon, cooking, fuck and go to dungeon again cooking and fuck. On and on and on...If in manga it's good read, because art is nice and has hentai material.But for novel I'm not recommend.", "Been awhile since I read the novel, did you read the part where she fights vs a \"juicer\" lvl 90+ person? I thought that was pretty cool.  I agree, there is alot of slice of life with dungeon and fuck int he story.  Unlike \"Kaifuku Jutsushi no Yarinaoshi\" where reading the novel was actually worth and had a great time with that story. Got until mid volume 7.  Manga covers up to vol 2.", "I came looking for isekai, stay for the PLOT and the plot.", "If you read novel you will know, this thing don't have anything like \"plot\"But manga is good read because art is good.", "Kirati Sattayapisut what are you talking about, there are at least two plot here", "Kirati Sattayapisut not just plot but PLOT. Get it?", "So new update can we expect a more steady flow or are we on the long wait ?", "Its not bad but not my thing. Remembered why i dropped this one around chapter 13.", "Time to start the long wait...", "First two updates were from November 2017. The next 18 chapters were uploaded in late 2018Then one chapter in February of this year.Then the most recent update was a few days ago.EXPLAIN.", "Yeah some translation groups go away after time.  A few others i follow recently just got picked up by others. It happens sometimes. What makes it worse is when it happens to a monthly manga. x. x", "Well, it's been a long time, no see beibeh! Keep Up Going!", "took 6 month for 1 chapter", "Mc is not a Pussy here he will smash that gurl if ur wondering!", "My only question is this : is he disgustingly OP in some way and fail at human contact? is this a basic harem isekai?", "He's not disgustingly op. He doesn't fail at human contact either cause well you'll find out.... and it's not a \"typical\" harem isekai because I honestly think this MC has a brain", "He isn't really op. He can get away with the things that he does because he's aware of how things work, even if it is bit by bit, while everyone else doesn't. As for human contact... Well, to be honest, he DID try to commit suicide, that's how he wound up in that place in the first place. If being paranoid is \"failing\" at human contact then I guess he does. But him being paranoid is actually one of his strengths, ironically enough.", "I was trying to recall why this wasn't in my list of isekai readings, so I started reading it again. Enough said, I hardly finished the first 3 chapters.", "Porque sos un gordo virgo", "0_ o It's your loss, this mc does a lot of stuff that people complain that a mc doesn't do. But since you gave up so earlier, you won't find out.", "I still wish this manga will have anime 😁", "Finally new update", "If you want to read the novel its still POSSIBLE, i've done it with the website cache, its up to chapter 221:https://web.archive.org/.../rais.../current-j-z/slave-harem/the translator first website is down but you can use it if you research with the cache because its the internet memory and you can do it with all other down websites.", "you can also use it to know what youtube looked like at the beginning and some useless stuff like that", "it's not 2007, we know how archives work, buddy.", "I agree.", "Somebody please update this thing!", "Please...Somebody from a translaton group....Please, this manga must go on...", "Can someone pls if they know a translation group. To have them pick back up this manga asap? pls :/", "4 months and no updates", "It's an interresting concept for drops in one's mana level to be felt as major mood swings with serious depression resulting from an MP depletion. I don't think I've even seen that before. It puts much more emphasis on MP conservation. It's not just a battery to be used up in every fight. Just like fighting with low HP has it's dangers, so should low MP.", "Any sex scene", "I bet the translators are already gone to Isekai", "Holy shit... When was i last reading this.... Now.. let's find out...  (last time he just bought the slave and went into the lybarinth once", "well there is only 2 raw chapter not translated online and since it is published monthly i dont thinck there will be update anytime soon....also instead of posting shit about hurrying the scanlator group, may i sugjest you learn japanese ans translate them yourself?", "Why not u do it by ureself , translating and learn japanese !!!Since ure the one suggest it ?", "Zay yhea its not like i didnt try, i can actualy speak japanese but as far as reading goes japanese is rather complex and i have'nt learned it yet... i would gladly translate it for y'all if i could... then again i would need an editor, a redrawer and whatnot for it to be of high enough quality so you guy dont complain because if it doesnt have enough page, the writning is not swaped whit the japanese one or the drawing isnt edited to fit the new dialogue youll still complain.", "Sarah-ève Gendreau tchh ,do less talk more , ure that kind of people right ,... ??? If you need a team , why not just join their scanlator group, since there r many scanlator recruiting member ? Just search it !!!!", "5/10/19 .   Still Waiting !!!!", "https://tmofans.com/viewer/5ccf5e38ecb81/cascadespanish", "A L Delgado Pichardo en español esta en el capitulo 10, he is waiting for the chapter 22", "Not continuing this, also, excellent use of golden hampster", "I hope a update comes soon. Also i love the leveling system and class sytem in this world. Kinda wish there was a game of it. :/", "We r in de same boat <3", "Try tree of savior rebuild, there is 5 job with 17 class each job, u can choose up to 5 class", "The MC gets laid in this one.Damn that was great.", "He gets laid to a girl he physically purchases. I don't think he even questions whether or not she's okay with it or even the morality of buying the slaves in the manga. But yeah! At least it's not prostitution!!", "Vincent Nguyen  Actually he asks her if it's ok to go thru with it or not and she nods. He even tells her at some point if your never ok with anything let me know. She was very happy he said that as well.", "this #isekai is what i would strongly recommend 5/5 XD -So legit (what happen when MP or Hp decrease and even how user feel too, or how they can become just unlock by doing a simple act that relevant)-Not prevented by standard moral (as they said When in Rome, do as the Romans do)", "Well one of the things i like about this the most is the leveling and class system. Honestly wish they would make a game out of that system the author came up with.", "in reddit are 2 more chaps in JP", "Oh man if the translation team is mia, i hope someone else can pick it up. I like this one and i want to see the author get to other party members.", "Agree", "Hey is the manga series over or not if not why there arent any new chapter", "No, it isn't over. As for why there are no new chapters,  the guys who WERE translating it, Otaku Cloud, well, they've been gone for quite a while now, so this series is in limbo atm. As far as the raws go, they've gone to the next few floors and he's plowed Roxanne doggy style XD", "Silfr Fil Godreon Yeah i don't get when a series gets droped. Like who makes the decision. Because i remember that danmachi actually got droped from the original group it had and it's still hard to believe that happened. So it proves any manga can be droped at any time. Probably for stupid reasons.", "Why there's no update in so long :'(", "I dont know why, but this one is really interesting manga about another world. I really expect that boy would hold back and try to make her happy and live happily someday or become SSS Rank Adventurer. I dont expect some event should be happen so early, lmao. But I expect more from this manga, cant wait for other chapter. Thanks XD", "I rate this 1/10 so many unnecessary fanservice that ruins the plot and turns it into P.L.O.T., it's ok to put some ecchi scenes but not to the extent that it is too over the top but if you are a pervert that is looking for a plot like this you would definitely rate this 10/10.P.S. I'm not being a dick about this manga just to disappoint the readers but this is my personal opinion you are free to check if it is worth your time, but in my case it is not. Sigh if they would just tone down the ecchi to a minimal this would definitely have a great potential.", "Pffttt ...Another perfect being guy ... I had enough of nonsense like this...U cant even make a story to satisfy a readers", "Zay LOL I ady stated that it was just my opinion why are you so triggered about this. Is it bad to write something on your mind once in a while? I know I cant make a story to satisfy the readers you are just another guy white knighting this manga LOL perhaps a virgin.", "John Christian Tan Perfecto yeah good to write ure opinions , but the fact u say \"you are A pervert dat is looking bla bla bla\" is kinda Trigger me to reply it ,.... But seriously let me tell u something ,, here u r reading manga with ecchi + harem tags on it where fanservice mostly trigger in many plot and many ways , and yet u want something that less fanservice on it ??? Ouh btw im a Virgin and love reading manga with story like this one , have a problem with that (Big Smile)", "Isekai genre is devolving fast, plot is good but its just poro which is not my cup o tea.", "Nothing wrong with it as long as it is done in the context of the story. Plus anything he does with her, he asks if it's ok or not.", "Is it by any chance from Yonakano Reijini Haremu Wo", "Deep Sutradhar yes it is", "There's a pretty excessive amount of \"adult\" content in this manga that shows up in bursts and when it happens, it can literally take multiple chapters. However, other than for those moments, it has so far (up until chapter 21) been focused on the Isekai genre. It's a pretty entertaining manga and I like how the mangaka has been trying to make his content logical, to which extent that is possible anyway. The MC isn't a typical wuss nor a badass, although he does contain some OP abilities.", "The novel tones it down a little, you read it \"it happens in a few words and it is left the readers imagination. While the manga on the other hand, emphazises all of those encounters to the fullest  ( ͡° ͜ʖ ͡°) . I like the novel, and his \"crew\" of different femal companions. I can't wait to see the fight vs the level 90+ 'Juicer' in the arena drawned out.", "where is that site!!", "I cant see the Harem in here wtf", "go read the LN, he already got 5 there. with sex maniac job", "Jun Lagutang Ah, I see, I thought it sounded familiar", "If you read the novel, you'll see the harem. lol Human racial -Sex maniac. lol", "on mangarock chapter 21 was  released already in january (29th).", "Did this manga get forgotten on the site. If so i'm sad about that. I like this manga. :/", "I like this manga too.", "Yo why cant i get an isekai website that teleports me to another world with my own character that i create when i search up how to commit suicide?", "Yeah truck kun i dare U😂", "U can do this too,", "why soooo long to next chapter?", "Can someone link me the site he wanted to commit suicide on? I will accept it right away.", "psychosis.org", "psychosis.org", "Does anyone know of a website that has more chapters of this preferably in English? Or is this a manga that got dropped?", "i think its because its slow", "Yeah some take time to update unfortunely. Have to be patient. x. x", "Morrrre please! This is such a good manga", "Harem tag isekai? Nope. I really tire of these shit.", "It's only bad if the mc doesn't end up with multiple waifus. Although some animes don't help with that not finishing up the stories from light novels.", "It kinda bugs me that this manga somehow progressing slow even it compensates some juicy fanservice scenes. I'd hope they'd show something big.", "This is actually pretty good for something that has Harem in the name.", "I like the art style of this manga", "Its good", "Great...chapter   ...next chapter plz..", "Chapter 14 is missing", "Who the fuck is uploading these? You have them all wrong you fuckwit", "the order of chapters is a little wrong", "This manga takes forever to get updated and it pains me greatly -_-", "All Mangas update takes forever", "Enclair Nin not all. Some get updated pretty often.", "Billy Trask that's because some translators are behind on the raws  ....a manga updates every month in Japan...in some cases when the publisher doesn't see any profit from a manga they sometimes cancel it...of if the manga or mangaka has some negative behavior or other stuff they got into its possible that a manga would either be cancelled or put on hold....it's slightly the same with light novels ....webtoons and web novels are an exception of course", "Where the heck is 8", "It's good read overall, but what is it that i feel?......o yeah it's fahkin THIRD WHEEL", "WTF there is two chapters not translate yet  7.2   7.3", "Can someone recommend another manga similar to this? Very similar. Not Log Horizon or SAO.", "https://www.anime-planet.com/.../best-isekai-manga-47218 try this link....hope you get what you wish for........Personally i recommend you read THE NEW GATE........pretty much the same as sao or log horizon........but the BADASSERY though......it's on another level", "Ranggadithya Pratama Noviardi lol i completed almost all of it", "chapter 7 and 7.1 is the same chapter", "Compared to chapter 7, her boobs looks bigger than chapter 6.3", "Want some Fuk???", "new chapter on championscans", "day 62! still waiting for updates-_-", "and 6h after this post, tah dah", "championscans has the latest chapter.", "6.1 was here yesterday, but it's gone now . . . wtf", "update sir...", "holy crap this summary got me hype and hook up instantly dident read it yet but i really hope its good and wont dissapoint me :D", "and also just notice harem is in the name lol fantasy + harem always good combo", "always  though", "I like the manga the LN is garbage after ch 100. Repetitve as all hell. I like grinding but it was literally pointless in this series. Buy a slave, buy a maid costume, level up, come up with a dish from the old world and have sex, then buy a slave and repeat. For over 100 ch!!! WTF", "dont forget \"get a new job\"", "So this protagonist goal is sex?", "Is that all? If there's something more please tell me, I don't want to waste my time on a manga that its author is a lazy person who likes to draw his lewd dream on a paper over and over and calls it a manga.", "also the manga is pretty nice", "update more", "Update plssss"], "Images": ["https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/290206086_5060356497393417_8447545048480345463_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=W5uc20IiW6QAX_sN1Bn&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT99w4c-pHEhw-R7_RbshFkP29hD-u0HSJNvCczXAgvZ7A&oe=62B9EF1C", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/288424064_7423380501067862_6688939170208230059_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=hyece3uVM4EAX9tqWuL&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT_0snEkXJtkk3Do_Wbml6tXLJqU1YrxRjc1GaMaRkB0OA&oe=62B8D032", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/282232718_746776746445058_3796427925157980967_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=XMre7B9mH3AAX-xP8V5&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT_f2Tidg6Znme58z6lSzKCUZrT-JF-bqC14D2ibcKN7gw&oe=62B918CB", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/282560806_746777616444971_6873335520517833687_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=I-mlI8U1yf0AX-INFoz&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT_zJx2bRbGJUhE84WBdDL5QkKsW994EF23i3_uD0QLVxw&oe=62B94348", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/281356682_166484029158412_9054332700398207117_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=t7VyCHWOI0gAX9lI3ZE&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_Cbr7CVzzVjzgFe4B-3bHWlBGAQTU_oG15DnX3PRcceQ&oe=62B8ABF2", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280207704_4937473299681738_5269055853930397083_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=BJkSZsXqz90AX8PAUim&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-F2XvmupH1FJW4NG9iJ-yXvnp-qgTmlkPYdwBJoWg0Ng&oe=62B98177", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/279447320_150540967480528_5677778648296968231_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=ecZRJfiT63IAX8HA7Bg&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_dBk5xg64JfejzUsmQR9azJJ4OciZy-B-aGOxFskRu5g&oe=62B956E9", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/278405404_363273829084104_5314053425175013141_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=F62lqVUFL_0AX-s2cb0&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9y3LcfVi83KEstL4ZVqA7XTzJ0iIi7QOcmgi3fAspAhg&oe=62B89CAF", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/277671223_667489920999055_9031513030562362904_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=xUpoHPBO7Q8AX8G1X0Q&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9nk4xKiNRYLS1xJKt79EUqP5dXJ1lDjKxHiNFI9JT9KA&oe=62BA6C2E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/274663266_1329530307530380_6198783351862094979_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=o9aCVAKgGj4AX_HClos&_nc_oc=AQmh4Q3gNOjJHz19o7Q5BL0P0BTSm3f6huVtH2dDe77wpMGanrcKEWzIH1Ou2R1K79I&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9PCLK5wyxGHUGw4E9tCSOx5qNvbjDmemmr6vgbwdpHSQ&oe=62B96E8F", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272996196_156033176769169_2169083230636156511_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=83PpWT7vLF4AX_qNYjh&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_2IvMMpocFZLsV99Wbt5TRwlkP925ZPwlrTsPhYAzCJw&oe=62BA906D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272174167_2139551679543284_286442467066639504_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=P_9LPP5HZvEAX8w-V9w&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8yonTRm0B3t8urIti94_U0ZrW0ykRBanAplEcoTouSzQ&oe=62BA107D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/273015162_2164680730346321_5739796366266859390_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=w536YoKqumMAX-vH6We&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8Z46cscdyhJFbxX8oDZJRS2PrGGETK9Vm5xRQ6Rfi8pg&oe=62B8B92A", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272822995_3085917161659743_3456515812264446810_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=qYzc4lunQaIAX8UdV_c&_nc_oc=AQmK6tMV6BRYdd13LoCojhhGzRODo65Bxt7ZV91o7fL2BCoOdOABNL2hsRpY_UAAqok&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9znB-uuQsfUx5QpYVBtKF1aC8v2sDZoGVNFbdjm_6vyA&oe=62B94253", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271283138_119097843958174_1146791015689591583_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=5b_1utgOqpgAX9y7AZA&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-1lMTTxUH_cFB8y2MX8kuzF81XEE6RAwIP8eAIm6NKRA&oe=62BA0159", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271618123_154713213565730_3209662001790267668_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=03lOSmh4uDQAX-7k7AY&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8CnNtaZEJ5RbKT_l2uQBrhEGpvZ4qgvEj7WveKYkE95Q&oe=62B9FCD7", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272877993_1004543717073960_3135973395440780543_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=xyn2j-brqMMAX8MEMxR&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT84t9fV6DlU-S2xG4rkOX-tvfuNlspeFxwQWx9AlZV8Jg&oe=62BA656E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/271724717_154713273565724_8350356711224738664_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=72QKHYU4_zYAX9ccZlX&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT94vjwQaXWv0cpeiENuZ8rerH5mycdRy14CipCcmyjQrw&oe=62B9C54B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/269808529_659873961836291_8928798235378254622_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=phmj5hCwhrIAX80kwLC&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9hpRvcS--ylsWU9IXHJ8_i5mqk5ihBwmmuTD5TzBesHA&oe=62BA531E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/269741445_240397338172535_4614312814938711529_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=j-0mbdwW0BwAX-TSFvv&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8ErUfgCBdSxl6dF_bCPlHa2end5liHFsvc0te61K_8Rg&oe=62BA5D62", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/272806822_2863186680646905_6322634878643916727_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=hVe8z-YBBv0AX-ybQFV&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8LT3BewDaN_55YWeo1CLigkTJRxYZVvuLfAQcpKxmbJw&oe=62B96B3D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/259477149_424054025867930_9007914450653726212_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=nGKA8KLZ1F8AX8TpmMu&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8aP8hz_Cqjl59-G8CZrFYrCHJL-Y0IwUHNxCj1N5-Xtw&oe=62B95FB8", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/257942946_423929852547014_6271478064503293936_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=VEX5IcpuU14AX-TU5fG&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_D8Io4MekyxEwamfk4rFKC90rZSJMkTMMrtlDA1xyhXw&oe=62BA2F05", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/257543646_2700673876907368_2476837992566291694_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=uM4hdeHUDeMAX_a3wc0&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9-vnyUPioibQbsMEbjs9n7xsWmhZk_TOgdK2QJYnwjEg&oe=62B9808D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/245653379_10166138846535422_6912988677754371013_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=zf7e6ErNaswAX9UBvJA&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8qr-dsRm1PsAkl2uMijWR1-f0EV8MRiPkBRsZFPet7UA&oe=62B9DAF9", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/245445528_328125222447318_3290609368955097599_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Cr-jH8HzUXsAX8gotG2&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_i6YrhD66GLNJHsje2G3gjCVJxi1N0LRRhs7c196bvaQ&oe=62B8F82B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/245761575_2991353067781461_2183718777810542398_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=wX2Qa8-rxNsAX9usZOq&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8xtDAuozshiLOWGngFJQlVZyazJoTtNRJmISMkW9QMpw&oe=62B8CEB1", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/241029463_211078784374020_3990577218863221066_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=AscY5NNXJfMAX_29sou&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8J7JW2EurbKAThQZPFeQnC1Nr5SVHXm6whHhVIpklNzQ&oe=62B998EB", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/240594070_741714096638372_4160114488528789713_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=lvb3IotA5bsAX92Za7I&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-VDiKAMWWsGKGxgaVW9exRzsHDzT9TkyD87jdw9wErpw&oe=62B8FA4A", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/239341940_208667717982700_806439329186986749_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=JjTXx5BQh8gAX-MDYb6&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9w9XHS7Qcd43GwjGOEuAycsbFTgBZLqCuW52dZZhYz9Q&oe=62B96797", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/235932327_352012526519138_8620078953497955633_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=ejk46X-QtUYAX9IRDN-&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9VwPnCer-nrUuoIZMbwggGwObibjApRyzREq3LR23kEA&oe=62B980D7", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/222294414_153647953535395_9128587911417847536_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=TRQS-ByuM8EAX8xnSQh&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-Yt9UFmtdQO6QBmwAJAvKIgxjqEj_OvqmJwY-1r6cQdw&oe=62B8ED0E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/223071976_519460359311583_7481517158232395676_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=2dYyQOzeIaAAX9lwMT2&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_zqLGLOQ6F7HrlwYcVFny6HkVpiYcPv8u7gnk_g4qdfw&oe=62B93B22", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/218393672_977788856331409_8336482997129725848_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=1xOkp31JptMAX8F8c1A&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8VMyJsMgv0BKjtQiTZxm4fxhMjlPn0FBEy3CmehB26IQ&oe=62B96257", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/212510785_278212127411316_3852189955424326664_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=hOR_JmIUlr0AX-YY1x0&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-2H7Hq7yK3dOzX29Xhha3WIusmEnTCJfEkLFoqYa1RsQ&oe=62BA2A5C", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189930404_479281993153183_4022397248300061578_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=3ECM6PCcLKIAX80-DW6&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9DLmSACfAIwRyCw2Zo4Un5S3IhEB4BAV2EclJjYOtEUQ&oe=62DB8A96", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/188933541_3534977896603266_5201863367005251977_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=OsG6EaNGXkkAX_UwNnT&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_SP09zJThQ7AE77Wq1obCRs44OW0hI460G0aHqSf_ESA&oe=62DBC01E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/191271295_2849843868587577_8086413630438003427_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=W1ZNil8x8JkAX_TRzVH&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT84BbwivG6ljLdb9yx-40_oHwdjZu_Bn4I2blCL5vHbig&oe=62D898C2", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/191585597_507962433960670_4038567902720427111_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Fak2373cPiAAX8UULgg&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_4P_SOD_selZdsxOmdsDVkvXqMW2ILofeMbge56kbq-A&oe=62D94124", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/191768009_2936292506642505_3966050451369333_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=AGcu-sMZpAIAX_DKJ-_&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT90q3cCt7ico-ptqY2hyuetw-2wkGOOP3cLiuHUu_0s-w&oe=62D88741", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189250967_343806417093779_8084381148491363387_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=JENIs0i66EYAX9QYn8t&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-E5zs3s0P7YRamOnQ5WGNIMgMzTN_nKK3-IsXCPO-I1g&oe=62DB1391", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189495023_251989796707214_3229802914206610681_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=__tqHjzXiuUAX-lwpWs&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_SFviFqgahtrjRkCgaWYC9tAlM2Y56Qz7DBiqPIJobqg&oe=62D8DA78", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189569197_2877896279145086_3539696464565161027_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=zpeGxMsvUdQAX-gCSST&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8i2NDTLm2wqbN5l-nfBj8mipsiQfscuIdCnd-8rvQWGw&oe=62DB737D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189255916_290806279363286_6292838340787977573_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=b4cmTrLcxNgAX8bVvBJ&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9x5r6pUCN2cM1wdcAcxkGtwofNjnN7AMWsqL43MClZoQ&oe=62D8C19B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189342419_2899983743578793_4729784981194814987_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=z02oZ037_9oAX-Fg5X5&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9KIWuLBKwRXsgkR4IoIradytVNNt-Ol-nrwO-ZJBfs-A&oe=62DB5E1F", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189361110_1425467621143054_5609091458915992220_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=RPiuowm7s7YAX8KweRK&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-yvKiZrZy-RrQoeWTjc5cWF12HkYeZ-R7ZfNszzE08Nw&oe=62DBD52F", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189038417_479281516486564_7915922652961722469_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=g9yMq-gBXToAX-lo7NP&_nc_oc=AQlq9PrdomF8ETNN6wvpceaECRcHtXTAPb9bETNbPrxZolZdZoBMLCYfgaEqzoGLdsM&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9NTnVNDXm9fygZZLSJsyKHPztZXcpLruBBLyv-WAdZWQ&oe=62DB05E6", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/193064078_911764666220771_8332754908781325938_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=So4hqC9Hb0QAX81tJgn&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_iR6mFRemDyiqwcUUypLEA59NGJldPsYNkSrjwJAD1BQ&oe=62DBFE10", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/190383618_1126052727861310_7069808334854399438_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=ERy0ZfWNIsIAX_zI2hk&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9tAv6U4cBputoOhm7FAamTe9eZI9ooIDIKoKMBxr7wiQ&oe=62D97392", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/188626991_318862419651204_7996732340247300601_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=BaKUHwep_ugAX-LPl4Y&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9TLTSBUP3D-7cuvSzYp4eoJUkSJv5Ss98LybjQVwgRPw&oe=62D9FD82", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/190472215_2923697274544645_9014397037069581954_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=S2cqm05FBlIAX8POnzE&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_Zz_Jfl3ZDVzjyOFlfSER6stq2reYpKkxB9VxHTrGiYw&oe=62D92E78", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/191933422_1815009248663506_6351043428645559693_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=hWPcbo-KbOQAX8OnTaE&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-5kQpWoLAmDx_Xm2yHuqt5j7rSdbGSKhjoeF0qd_1JFg&oe=62DAAFD1", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/192033588_925034054739242_7646766609064401656_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=qklLVF5Ee_QAX9ttTTB&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8M4Aiyp4tNP0ZuY7J9vpacSkBjgXyqkzdi0x5dzDTzzg&oe=62D9E80F", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/190121611_337957484353017_4942825526554830907_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=A-QlyPEXSooAX-ArGIx&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8NKZs2ZqVH6B4jZZG5hxOILXcQ9Xwb2ZQogwUSy4TtIA&oe=62D87292", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/193195125_2964496983871670_7145460500218020675_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=MbUkuOy7HfcAX-mdA1j&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT96HEdDW9mVN0fVpaZbV9pxBLMMKG3bpQ967Bvg9k296g&oe=62D860B3", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189939340_935342343968535_7270611400871999844_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=RLL5i1-OacgAX_uaVUh&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9yDSybG8PWNx3vpJS1x_AviibGpln7LyavUBER7aW24Q&oe=62DA0C77", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189038795_4019926168098056_5747648310803368748_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=0pGDqyTjP3oAX-txDf7&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_fCt5dJfffQ2VcFBkHhSB6RkuT96UBVBCijuGBr3AgCw&oe=62DB6ABF", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/190413981_1165542537200400_5255104844461008662_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=TgcdSL9RghIAX_z105V&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_-O8olC2wBufgofd4GQFH9igifr4pBatbDAJV3MLwnJg&oe=62DB531A", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/182060538_10159302033858162_1074562752288578536_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=KHpbRmLJ4NEAX8wdqwk&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9QmV8chZr_IRbUE85sVIay4CKrXoKxFfoEvFPvhAZDAA&oe=62DA0106", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/190270756_2877868652453377_3377151287541531689_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=GPL-wbKSNzUAX88enhD&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_H5_5qd8c__zG06t2_-d6bsV0Shki_crr3Ut60XRaukA&oe=62D964A1", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189662828_1029727647558024_2869410902287978686_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=NXjE9cY7giAAX9GRraZ&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9mdbNbA28ur0ynutYcX6dGaSQelnMq4iX834cdhmKbYQ&oe=62D9EC2E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189255916_1815008341996930_54079549811057167_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=bChL-S-lkcoAX--ZIhy&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT980yHFUDM6ufpEruIKM6FrLPkC7y2bF2DH0V28D9yCwg&oe=62D92D2C", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189432238_479280489820000_6796335890721043404_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=-Ob_KaFcDiIAX-vY3Ql&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-uCJELuKT3_BTIvJHFPrAgThgHnsZG1qshyEnSNzUY4g&oe=62DADE9D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/188953171_2694254844198814_723986007114285762_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=a0DGQr7HZsAAX-7ubfI&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-hZTHgM40emFOA5DXz3nIgLT0f13-_vVsfpVcj8lI9-Q&oe=62DB8028", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189426054_327551098804924_2768151046984261524_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=M5oJevatlbMAX_j7h6f&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9hsO0rsuRkcWzsLLDugGHFo8mD6sFPNhcGnI6iY1i8KQ&oe=62D8EFD0", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/187569044_1815008018663629_3400007009985856314_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=zGFjCY1mlOUAX-9R53M&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_wFRVFzJo20ywDBcgF2gaIisAWR8miSyOrGDf5kUjWsA&oe=62D9F169", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189614914_1171983666596771_1848562692134833884_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=GEJ0ta7MHCYAX9G942N&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_ZdY_tYD5kSQ9dYLtC5YhfMnRPK8gR3Vz9KoLrELhvPA&oe=62DA9C00", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/191680916_3913314538785837_1661529059678759567_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Grn7jc8_e3AAX8r4jzV&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9_8s3wcKFTWRtRiLxeK8KNTqZyX7tw9G8rdWg-ajf26w&oe=62DA7C11", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/190357626_4270310259666995_6275859548905872390_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=oj3hoTxgQrwAX8Xx123&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-k2JuRsHif_5LuBfIiWOHvn8yJuGVruCLfHGBkJTKaDw&oe=62DA50AA", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189495026_4013515355401732_4793747634976828054_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=hCHvVlzAHIAAX9OELub&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-edSCOjv3KrjoH7BQk_uRtkgmm-PmuVyRYw2zhgcaJqg&oe=62DAE3AA", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189246485_986264848851749_3329920444008772450_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=pg5M3rA91awAX8_i6em&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8SBjJGmCnp_Q8nfTiMU3GOvgQCi8I7SGJ_nVEnfqKp_Q&oe=62D86ACE", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/190493354_986264755518425_1457491843962225503_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=XbvZTXuqY9wAX9xwo2a&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8e8nxBIN5efOG_vq-9zvg6c1BCWrSuX0w2or2qZ1N_gw&oe=62DB3AA8", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189988892_986265092185058_4374667011708115716_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=hRDg8CXL0XwAX8LiCTy&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_6eVVXWi4axcz0KXh_jCuILDmmtxBUfe1i5T6xxxLDcA&oe=62DB4989", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/188715065_986264592185108_5583882268403534762_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=sILmLFYLT0QAX8MDotQ&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9r5s84be0eKvbCwAPaigPk_gR9HfHWxQUbfaP7qBslBg&oe=62D955CF", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189698236_852388108697072_918362803245263265_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=R9bW6xtN8r0AX8XLqNG&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_p0BUrp-OD6RkqKLQ5FSq0CXI6PfVExdv4RLf8cOQYeA&oe=62D8A366", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/188460116_2880006542316814_5370455476405421102_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=wxy3hL73AesAX9fWBxO&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_XMbxVznTn3m14wikaNbXgynYoCu0Dz9A6jcuU4YDeaw&oe=62D9D35B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/188581945_986264808851753_2309209659234675842_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=4yxv4m2e_ZQAX8ODt7g&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_mzmtM0OoAVwKmlWqoN7cv843S0E0kN_YBJfeAPWnS7g&oe=62DA3B40", "https://scontent.fdel10-1.fna.fbcdn.net/v/t1.6435-9/189889990_4236253233128907_4678192289072050700_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=ZFnUngLAd_kAX9fKGRZ&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_e7wKGOItdseHuTh7aaZpf6CQT0GPnIZn5V19TwD1KLw&oe=62D9C608"]}}