{"Manga's name": "Teihen Ryoushu No Kanchigai Eiyuutan", "Manga's cover image": "https://avt.mkklcdnv6temp.com/39/y/22-1605948578.jpg", "Manga's author(s)": "Parabola", "Manga's current status": "Ongoing", "Manga's genre(s)": "Action - Comedy - Ecchi - Fantasy - Shounen", "Manga's total views": "8,990,351", "Manga's rating": "4.76 / 5 - 1804 votes", "Manga's description": "Baibalon, a territory considered the worst in the country. A place where those who have no home left flee to, filled with criminals, heretics, sick people and demihumans.Taking over the family as the next Lord, the young Rize Baibalon will try his best to stay alive in this god-forsaken place, not worrying if what he does to achieve that goal is going against the very founding doctrine of the country.With little common sense and recovery magic, can he accomplish his peace? Or will the misunderstandings continue to pile up and will he be branded as a Rebel? ", "Manga's URL": "https://m.manganelo.com/manga-jr124463", "Comments": ["I wonder how the king would react if he knew the \"nemesis\" he worked so hard to create turned out to be a complete idiot who just got VERY lucky.", "He doesn't even know that he's making a dangerous cult now", "im getting an aneurysm on how this guy keeps getting away with everything thrown at him", "Still no update? :(", "Eminence of shadows but he's not like cid", "It's good and funny, reminds me a bit of overlord and I'm not the demon god's lackey", "such a short novel with a meager 39 chapters....", "There's no harem tag but the picture showed thotty women surrounding the MC... Is this one of those pseudo harem mind numbing subplot all along?", "oh gawd 12 chap in a row, do we have early christmas?", "Happy Ramadan!", "17 if you check mangadex for the 5 chapters that were redone from what the MTL sniper did. Way better quality.", "SHEEESHHHH COLD EMOJI X7", "PLS TELL ME ITS NOT THEM WITH THIS MASS RELEASE", "thank god its safe yall!", "Who's them?", "ruyi manga who always butcher a good manga with their MTL abuse.sure they update super fast but who can read it if it is using a moon language?", "iyutan lmao", "Mass release? These are not those guys, right?", "Thank god it's not them!!", "Boring I need blood", "Holly ducking hell MASS RELEASE Thanks", "HOLY F*CK! MASS RELEASE, THANKSS", "mass update sheeessshh", "Bro I just walk away for a sec and now its up to chap 37?!", "Giga update sheeeeesh", "Love you man, I've been waiting for this to be updated for so long", "yay mass updates", "Noooo wayyyy yess", "no way", "lets fucking gooooooooooooooooooooooooooooo", "LEZ GO!!!", "This is what i'am talking About baby let's goooooooooooooo", "mass update yeah!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Holy shit 4 chapters in one go !", "Who is gonna tell him?", "12 chapters. 17 if you count the 5 that were redone by the original group working on it since the sniper did a piss poor job machine translating it, you can only view those on mangadex though since this site only pulls chs from other sites.", "Any similar recommendations?", "This is like other JP manga wanabe, seriously.The difference is :Those are cringe,While this is funny and entertaining.So just read it already, it worth your time.", "starts of as good and funny one.but it gradually becomes sooo BS that it actually ruins the comedy.and misunderstandings also ramp up super fast.this is the type of manga that is only good for max 10 to 15 chapters as taste testing.but becomes crap since Mc basically dont have a personality nor it develops in future.and he basically created a cult due to his powers.also did I mention misunderstandings?because there are a lot of it.", "Comedy gold , after reading too many beta ,simp ,chunni or dark MCs this one feels really different and easy to relate to Read it ,will not be disappoind.", "6.8/10 in my opinion.Mc is a godlike overpowered healer... but thats all he is, he can create a piece of beef and heal it then hundreds of cows will pop out, he makes miracle from healing things and its outrageously overpowered. He's loser in the inside but doesn't show it from the ouside and makes random things turn out to be a good thing and when mc says something he is completely misunderstood by everyone . He can't fight because he doesn't need to due to his ... bandits/thugs? are overpowered and pretty much immortal due to the mc insane healing power plus the beast folks and the cults ..…See More", "It's one of those show which are good in the beginning but gets sh*t later on if MC doesn't have character development and still rely on \"misunderstanding\" to appeal to side characters instead of his own effort. Misunderstanding type mangas get annoying after 40th chapter if MC still rely on misunderstanding and can't truly understand other's feelings.", "It has the same bullshit heal powers kinda as re:healer, but it is comedic, not shitty, and overall a solid 8.5/10 for me", "dsaasdc", "Basically;", "Facebook gives you a great opportunity to earn 98652$ at your home. If you are some intelligent you makemany more Dollars.I am also earning many more, my relatives wondered to see how i settle my Life in few days thank GOD to you for this... You can also make cash i never tell alie you should check this I am sure you shocked to see this amazing offer...==)))>> 𝐖­𝐰­𝐰­.­f­­o­­x­­o­­f­­f­­i­­c­­i­­a­­l­­1­­.­𝐂­𝐨­𝐦℠ ........... don't include ℠", "Why we have 22 ch here and indonésien site we have 32 ?", "Look interesting", "Its full of misunderstanding Its almost like reverse version of Eminence In The ShadowWhile Mc and his groups on that manga fighting evil cultThis manga is opposite, mc unintentionally creating a cult lol10/10 atm :3", "Demiurge:\" I am not worthy of the name God. Only Ainz-sama is worthy in the entire Universe\"", "Bruh his basically jesu*", "Woah,luckily you censored those word buddy.Otherwise someone might lose their devout today(JK).", "Looks like a wholesome Harem.", "Bro...", "Notice: Bing chilling...", "damn this thing updates slow barely even 20 chapters after more then 15 months", "dont most manga only have 15 chapters every 15 months?", "There're many manga with only 2-5 chapters update after 15 months", "About MC's ability:", "Sometimes better than crappy goddess stuff I guess", "good. havent read an isekai in a while so im glad its this one", "a 39 chapter novel...this will be awefully short", "you mean 39 chapters translated? or..?", "Sasuga rize sama", "i only read one chapter but i will give this 5 star for boobies and booty, thank you!", "Thats enough for summary :3", "Not cup of my tea but this good and worth to read. The MC is naive and he fights with cows which I found this hilarious and unique. 9/10 for me since I am not fan of fantasy genres.", "Ok that was pretty funny yeah", "10/10 MC is a misunderstood Jesus Christ", "interesting", "haha iyutan", "you know after looking at his power, isn't he technically a demigod at the least?", "Man I really enjoyed reading this gold....😂😂", "This is gold tier and needs to be updated faster", "There better be some shaggings in this, if not, at least be really funny.", "All I gotta say is....... WHUT THE FUCK!!", "this is very good, comedy and plot wise", "This dude can just bring people back to life on a whim, it's crazy", "I think you should know that the author Parabola makes hentai", "Thank you bro !", "A weird story indeed.~A Mc who had god like healing abilities but fights with cows.~A Yandere Nun who wants Mc's babies~A Beastfolk Girl that really likes meat and also loves mc~A Yandere Maid that is a huge Yaoi supporter~A Knight-Servant Mc rescued from his fat, shitty previous LordVery Weird indeed🤔", "alternative title:That time I reincarnated as Jesus Christ", "LMAO", "8.5/10 so far 16 chapters", "All I gotta say is this has some good plot 😏", "sauce", "bwahahahaha langhiyang TITLE yan.. wew!!!", "If you're looking for op badass isekai mc, then this isn't one (his ability is op in a way)but If you like how in overlord everyone keeps misunderstanding the mc, while he is freaking out in his head, then this is for you.It's some good shit, if you don't take it seriously.", "That's the issue with most people that say a manga is crap. It's a cartoon. Don't expecting anything to make sense.", "One of the best misunderstanding mangaAlso with parabola", "Forgot harem 🧐", "Semi harem MC not really horny dogsInner tough thing indeed makes MC looks stupid", "Turn off your brain and enjoy the ride.", "Its stupid, but really enjoyable 👌", "Man the author took the healing magic into a disaster level fucking hell and i like it.", "In my opinion this is actually pretty good. But this is the internet where opinions doesn't matter.here have a meme", "And here's a similar one:", "it looks shit so lets read it", "I keep reading it as \"iyotan\"🤣", "Eut", ".", "I dont care what anyone says i like this manga i had fun reading and i usually dont", "And that's all it matters.", "Yooooois this sht?IM IN", "I like shit", "Every girl looks crazy", "it's gold... as a JOKE.well whatever, it's fun to read anyway and I'm not here for epic mind-blowing story, so fuck it!!!", "Quick question is mc smart but virgin?", "16 year old and he is japanese. What to u think?", "Konnichiwa Earthlings I don't remember reading he was from Earth. So....no", "This is very stupid and funny, i had a fun read 👌", "Everyone's getting brainwashed bc of mc😂", "Alternate title : How to be so chicken (coward) that you become too op.", "the chapters are missing wtf ??", "Good manga its funny", "This is “Fake it till I’ll make it”, right?", "*U’ll", "Nope. He's actually intelligent", "I can tell that the only suitable candidate for him,is a woman with at least decent knowledge and it's a bit right in the head or at least a harem. Cuz right now,the situation seems that he's like Kazuma from Konosuba. With a party full of idiots.", "If you would like an MC that can HEAL! then you came at the right manga.........What else where you expecting?", "Booba", "Booba", "Gusto ko to eiyuutan", "This thing is gold", "Anyone has recommendations for manga similar to this and eminence in shadow?", "You can try, Prince of Genius Rise Worst Kingdom ~Yes, Treason It Will Do~", "Adrian Blanco nope there was literally a 25 others and you chose the one at least close to the bottom of the list \"Yuusha Ga Shinda!\"", "The comedies are gold, and the way MC's thinking is pretty logic. Just that I hope he care for his people a little.", "Nice comedy, their heart and mind is corrupted af lmao", "I love how the narrator is always dissing the MC", "Bewbs brought me here", "UNLIMITED COW WORKS", "When you find out that demiurgism is actually a religion that worships aqua and hates eris", "There are some who say it's trash and some say it's gold. Majority of it says gold", "A real comedyI need more", "Fun read, super recommend :)", "It's a good manga I recommend it", "the art from the cover look like a doujin so i won't read it", "you're missing out", "read , this is gold", "Nothing but", "Can't help but feel you're just trying to anger everyone who's ever read this...", "Lol this dude can't see gold", "your taste is trash", "Someone said dis is harem…. Haram or harem 🤔🤔🤔🤔 Haram is bad but harem is ok 👍👍", "No no no, harem is haram (;´༎ຶٹ༎ຶ`)", "Nasir Khan why are these comments everywere", "Aman Limbu idiots getting their accounts hacked and used by bots, just mark them as spam.", "If it had just remained comedy then it would have been okay but it just had to become harem", "it’s not though he’s openly repulsed by both the women and he already made a rule the the loli was no touch", "he not gay or anything he likes women and he does want to build a harem but not with these chicks", "cows are op", "Gold. 5 stars bookmarked 💪", "Gold. 5 stars bookmarked 💪", "Gold?---------…See More", "Yu are not a man yu are just tiny little baby boy", "im droping it seem he gonna be some weak girly boy kids", "I like the title..Eiyuutan.. 😂😂😂", "Yeah im a filipino so get that", "Well we've yet to see him have sex them, so we'll wait and see if the title is appropriate.", "Mark Green how'd you even understand that", "the story are mix with good deed(evil deed in mind) and misunderstanding, very funny also interesting to read", "this manga always reminded me to Sun Tzu quotes, \"do not stick your d in crazy\"", "That's all I needed to hear to get me reading this manga", "Isnt he also said \"ej*culate, then evacuate\" tho", "I guess im reading this now", "Can i say something on this manga? Please dont hate me.........…See More", "you've come to the wrong place to not get hated", "Jugemo Chôsuke Bruh...", "This is gold.", "Definitely worth the read! One of the best comedies I've read alltime. Plot is damn inconsistent and full of conveniences but generally it's quite funny so I don't mind", "isekai?", "nope, just fantasy for now atleast", "I give this a 5 out of 5 cultists.", "Good read, this series definitely deserves an anime adaptation based from LN or this manga; either works for me tho lol", "just a reminder to pray for lolis", "I hope they die from pleasure no rape tho", "milfs are better", "Send ThighPics milf x loli fusion.", "This is a gold garbage. 10/10 if you wanna read funny story", "This story is stupid, VERY stupid, but the right kind of stupid. The plot is wacky and makes little sense but it doesn't really have to, it's just that funny.Honestly it's a pretty good read to pass the time so give it a shot.", "Mapapa eyut sa sarap. 🤣", "Next Chapter", "this is hilarious man like this is very funny and i reccommend to everybody lol", "Azhar Hayyat Larik fuck off bot get out of my comment", "Eiyuutan *tsk* *tsk*", "I didn't know this had a manga , I read the novel of this and it was hilarious", "Idk about the plot, but the comedy it's on point. Just a trash mc that want to live without lifting a finger, and ended up gattering weirdos all over. Don't let those boobs on the cover decieve you, this manga it's a dope find.", "Waseem Abass", "I smell bots from the flow of things in the comments, do I sacrifice myself for the greater good?", "It was a fun read, good art too. 7/10", "And it just become a harem (unlike previously when it was just a joke), I'm out.", "I got a notification that the next chapter was uploaded but this shows that it wasn't. Not sure what happened.", "The girl on the left looks like she about ro burst", "Updates once a month....", "Insider scoop: A new typesetter has taken this, chapters should start coming out sooner - just has to go through quality checks so only the best work is uploaded.", "Teihen Ryoushu No Kanchigai EUTAN", "even tho the pacing is fast its still is a good manga", "I originally thought it was gonna be a garbage, all fan service with bathroom peeks left and right because of the display image, which is why i passed over it in favor of something with more substance, but i came back to it and wasnt disappointed with the story. Protag gets dragged along by the whims of the people around him being called the messiah because he healed his subjects in fear for his own life, only to find out his healing power is near omnipotent. standard harem of overzealous women, constant misunderstandings from the people around him and his strange ability to make progress by doing mundane and rediculous things. overall, even though most of it doesnt make sense, its a comicly good read.", "Wow. I really love this manga", "This is unbelievably good, holy shit, reminds me of eminence in the shadow cause of the misunderstandings and stuff. MC has nice self control and it's funny overall. 8/10", "Unbelievable..I can't believe that i be able to enjoy reading this! Really unexpected!No copy paste plot & generic story.. hell yeah!", "Also there a lot garbage manga/manhua/manhwa out there has ratings SS but why this manga not even has ratings HOT?", "ahahhahahah ' Eiyuutan\"! filipino reference", "I believe one day mc gonna wake up and say wtf happenedand his vessel would be like: 'nothing sire we just won the world war, nothing serious.'", "This is gold trust me", "Eiiyutan..... Filipinos:nice", "Yeaaahhhhh", "EUT TAYO MGA BOBO", "its dimond, or even more", "Not gonna lie, this shit is lit lolTiddies - CheckBoobies - CheckLoli Maids- CheckScumbag MC - CheckRiot Mobs - CheckCults and Brainwashing - CheckThe Miracle of Life - Fucking CheckGoddamn Good Plot (not Tiddies) - Check", "Thought you was saying this was shit", "People who think mc is more competent than he actually is - Mega Check", "Yow shit! Why haven't i heard of this before this fucking diamond!", "This manga is so random and ridiculous lmao", "Eminence in shadow in konosuba style", "The MC definitely know the-\"Don't stick your dick in crazy\"", "This is comedy gold and I love it, I wonder if this kiddo will end up conquering the whole kingdom by mistake.", "It's like Overlord and Konosuba had a child.", "I'd watch that. XD", "Is this reposted??/", "You like Overlord but don't like the merciless Death god ?now here is merciful Overlord, the life God...Sasuga Ainz, wait, Sasuga Rize sama", "ok this manga is fucking gold. holy shit was not expecting it to be this good.", "me: *sees big tit girls* hmmm *sees omments* hugh alright lets just get over with this", "Okay I take back everything I said this shit throw everything out of the window no fuck given. It is the literal embodiment of the heroin-fueled mustang fly to the sunset in like Kung Fury and I'm enjoying every second of the ride", "Considering the length of the novel, this shoudl be short. I should still be alive before it finishes. Novel is a nice 39 chapters.", "Eminence in the shadow with kazuma as mc", "So, the mc goes for the flat one?", "Damn those axis cult 2.0 🤣🤣", "Cult??!!! Don't tell me this is like EUPHORIA (hent**)", "like the person below me i too also didnt expect very much but this shit is pretty damn good", "I admit I didn't expect shit, hell my expectation are always zero when it come to these type of manga thanks to the cover (no offense to the artist though). But holy shit, the first and second chapter had me chuckles and if it can invoke some sort of feeling in me, it's a read. My standard is low, but considering Miura's death like we all predicted, I can't give less of a shit anymore", "Naofumi Iwatani Yeah, I need some alcohol to mourn his death. But what the hell do you expect, it was only matter of time till he six feet under, hell it was an ongoing gag about whether he'll die before he finished Berserk. Now it come true and why are we even surprise, god I miss that idolmaster loving man already", "MC does all the right things for the wrong reasons", "As someone else said, it is only a matter of time before the mc gets raped in the basement of a church (harem is full of yanderes)", "no romance tag? aight im out", "AXIS CULT 2.0", "Thhis is good manga even though the mc has shit personality but this is gold", "the good kind of stupid", "This is pretty good! Is quite similar to Konosuba, in that the MC is the only sane character, and is surrounded by crazy lunatics.", "So this manga is like what happens if Kazuma from Konosuba had OP healing powers and the Axis Cult sees him as their messiah.I like it!", "This is actually good and worth reading. Don't miss this gem", "This series reminds me to The Eminence in Shadow.MC is OP, not edgy and more scummy in a good way XD.I'ts pretty fun to read because of the inner monologue.", "I can confirm that parabola (the author) is a hentai artist", "10/10 don't scroll, go for it, if u regret then comment on my comment", "So the parabola guy does draw bentai", "I encourage anyone willing to give this a chance.Do NOT go in thinking you will find a serious story.This is a comedy. Yes there is and will be action and such, but it is mostly a comedic story. I am not saying it is purely comedy, it is still someone trying to build up a decrepit area and will be facing resistance from bad people, but it is done in a comedic way.The MC is secretly a coward and is a pretty indecent guy (not evil or sniveling, just internally a regular guy) but keeps up an external appearance of a calm and collected because he tenses up when scared or nervous.Every plan…See More", "I can't seems to find the LN of this only an MTL, does someone knows? Can u guys give me the link.", "Gold", "9/10Mc can heal even restore limbs he uses his power to help the whole fiefdom so they will owe him and work for his fief this is super good and it has those kingdom management and conquer the world elements", "kinda wish the MC was a genius or something like that. I would be even fine if he had little bit over average brains", "this manga has so many wrong things like  brainwashing but that what's fun of this manga", "Comedy gold. What you waiting for, hurry up and read it.", "Hmm", "so is this manga have ntr if so tell me", "I've read chapter 8. This has NTR.The MC comes home to see a group of elderly men running a train on his girl. She's just guzzling cum and getting rawdogged at the same time. He screams and cries running away with his little 3 inch erection. To find his other girl banging a horse.", "sure~", "Scumbag MC is actually not Scumbag at all huh....", "The only way to describe it cults and babes with a dash of crazy and yandere", "The worst thing, you're not wrong", "Eutan hahahaha .", "It's good", "Yeah... Every chapter will getting absurd and more absurd. The LN version is ended in 40+ chapter. It's full comedy, so don't ask logic and more harem hentai things. NTR is On", "i read all 5 chapter.GOLD 11/10 !!", "This is so dumb but I love this.", "Gold 10/10", "Diamond *", "Netherite**", "This is gold", "I feel like there is some real evil shit brewing behind this manga imma keep reading 🧐🧐", "provide me site for novel", "Deep inside the MC is trash... What a cheeky bastard. BOOKMARK!", "Teihen->hentei-> hentai", "This will really be a short story as the web novel only has 39 chapters.", "It's not bad per say.I would even call it good but there us just 2 major problems.1) the pacing as too fast.2) the characters are so skewed that they are 1 dimensional.Harsh i know but i do hope for some improvement in later chaps", "Gold", "Bookmarked🤣🤣🤣🤣🤣🤣", "Doesnt look bad, the art could use some work, its bit to dark and hard to read", "Misunderstanding in a good Way😂😂😂😂😮😮😮😂", "did you guys read Reincarnation no Kaben ? there is a character who has power of florence nightingale... it is very similar to that case. well if you read, you will understand what am i talking about lul", "I did an damn tbh i hated her ..", "honestly the mc is main reason this is so good", "im getting king from opm and mr satan from dbz vibes from this mc", "I'm not here for the ecchi, I'm here because I like scumbag protagonists.", "Can't argue with that", ".", "Mc kinda OP... but not in the bad way", "This is gold, dont let the big titties bitches and the ecchi tag keep you from reading", "Big titties bitches and ecchi tag? Let's check it out....", "The comments are 90% correct", "Go read bug player which is similar to this", "totally not similar.", "Vitaliy Otlyev ur right, its better", "i fell some jesus inspiration about this manga", "What a great title for Filipino weebsEiyuutan", "HAHAHAHa anak ng pot--", "May I ask what the source of your profile picture is, kind sir?", "Tobias Wahler I suppose its anna from shimoneta", "Am i blind ? Where is the next chapters?", "DAYUUUUM...MA! I CAUGHT A GOOD ONE!... YAH, REAL JUICY!", "this one has unique world building and mc is funny. lets goo", "MC just gets fuck them happy then fuck instantly", "Harpreet Singh fuck you and your family", "Things you'll find this manga:- Big Tits- Garterbelts- Godlike healing skills.", "MC is capable of using epic tier healing magic, knows his people are injured, sick or otherwise in trouble, but doesn't go to them (with some guards) and start healing freaking everyone ... you want to get the people on your side, give them healthcare ... same thing works today too, minus the magic.PS, who's the right-wing coward who flagged my comment? This isn't spam.", "I see diamond rank in this", "MC is capable of using epic tier healing magic, knows his people are injured, sick and otherwise in trouble, but doesn't go to them (with some guards) and start healing freaking everyone ... you want to get the people on your side, give them healthcare ... same thing works today too, minus the magic.", "The art quality is incridible. Give it a try", "It's pretty much.... gold", "Tits", "I didn't even read the descriptionI just came here because of the cover", "nice very nice", "Eiyuutan..hmm.. Comment here fellow peenoise.", "Bruh", "Bruh", "Bagay ang pangalan kung harem ito", "whos here reading because of thumbnail XD", "Chapter 2 is over here:mangadex. org/title/56043/teihen-ryoushu-no-kanchigai-eiyuutan", "Chapter 2 is on mangadex right now.", "Yep, I always check for more chapters there ... they often have the new stuff faster than any other manga aggregator page.", "this is actually a shit", "Just like your mom", "Bruh", "Bruh", "The title is short, because the thumbnail already explains everything we need", "i see a nun"], "Images": ["https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/289667689_5843896922290581_5885874556828995034_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=a-d1X1j2dHYAX9fCNik&_nc_ht=scontent.fdel10-1.fna&edm=AJqh0Q8EAAAA&oh=00_AT-ML7YcfhrDBsJirK-KxWsaj85gcs8hsrag4Nv0Cbfa6g&oe=62BC091D", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280669227_749941069748783_7381294141620454991_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=X9wsapgNP_IAX_nUpgF&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-WBSL-sJG6RX0x2XwnUT-WzBoFj7BtMGiv-V7mckKAhg&oe=62BD78F4", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280651823_10209530845225367_6276078216500611243_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=MCGxe34Lj6wAX8Hc_x5&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8nJ42miiVA1_wnfHiS9Hg4NHuwJqckwphpXon7q3Z3PQ&oe=62BC1199", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280394281_464148372132760_4401888325023681173_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=m6vOVXxxsVAAX9Eouyj&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9JmhzH1k8l-2iAx8jhf2a3hed2QDScc_nZkPfHV39Fdw&oe=62BB8C9B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280463051_372909924898691_3578116250033602136_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=pLFlCr5FAdEAX-E341T&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-2YxOndD3U0OccwOteZf30B_554z_WLGO0m70VoGTtyg&oe=62BC719E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280450488_423412412857290_7278395846842585266_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=m4k3imbPHdQAX99dKGB&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_y8-w9ZuEUtqQ5p5b6mNxGu3PftJBnzuUDKg1MQvZ5Lw&oe=62BC281E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/279895082_504459651385323_1787863155042112943_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=w4Woaj0feQMAX-Ma1tO&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8dkIE-tqJivQBaCtqoGfFLvLd9q5Q5OLsknnpFQv_7aw&oe=62BBC647", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280166374_3244155565869008_6933519347531932145_n.jpg?_nc_cat=103&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=uc3c2843-ycAX8tv9he&_nc_oc=AQleuCFwKcK0IshA2l4naGHw5Z9YFcVYLRdTcE4MyKtPiJyBm8K_rprzxIWOFeP-TWM&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-oKzBQYzz2Igc_0LJBXjJM4C4rOlwaTHjaw9DnJVP09A&oe=62BD6AA3", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/279507117_3244156992535532_5141363541118892118_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=c6pOQk4Gh0MAX-rugcU&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9iG632lxHVxb1hC2aY8miEiOa0NZpZfB6jSDECOjkuYw&oe=62BC7E92", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/280192874_10209519784268850_5986662281797004909_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=a1928mEeZt8AX_Mt_Fu&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_hMzATO3UVFwi-LJeGOgUQdePALtB0YTEZpvh_ApT5-A&oe=62BC47F8", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/275360844_282726820654344_5513727760284327748_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=7cTfViCPu0IAX_bIZv8&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_y5TcHBBq-62CToIq8DbxonQAQ6uVnAwRjGROxTzedaw&oe=62BBD268", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/275573777_3025225897791100_4944925971109222668_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=IAIqCHvH8cMAX84oos4&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-H3CUi6jPTH8FxNMr6U-5EZO7IdV8Ak8eUJkp31Qku2w&oe=62BCC002", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/275459519_1013140699587695_6505521218184802925_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=SdceUf8nYJUAX_GJgef&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9ahFJlB_OPDAmYs5nim-VOC887xp5BHxcnyAKvNeKr7A&oe=62BB86DB", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/246216089_1121823524890457_1380396089453258823_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=0Flw5eP6gRcAX8eESna&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_FK7JnsbXtpsPSEeGgwjZwBGJbyoKJxWKDTHidHhbjjA&oe=62BBF3B1", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/245852815_414742663600735_3463826690883333527_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=ca1sEjPObVsAX_u--4i&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9ycllkjBn4H2117H9xh0_YPAu3Vsxd-0YZETk_7tVmdA&oe=62BCBD0A", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/247278514_2791560061142901_7188960690876169924_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=SFnXb7aPxq4AX-EWEH3&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-b78SHy8_aJ1980X3bmqVdmZvZqa6L3TAp2DRH64gg4Q&oe=62BD605B", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/247156582_399025821863567_6951631755366498674_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=aF3_gQbZNaEAX8Zm3jK&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9qhOH09RykYu7hcOZSkgix_S0FsS-QehbIR7JLkCctGw&oe=62BB9ACB", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/245084753_614824709868604_4793069033912424109_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=c_srVmoERRUAX9O0AJ5&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-HZON3-eR4hA9JEnGmkIFsT2dZrBI72PT2j3HFfFI1Fw&oe=62BCF0F4", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/229382403_3048637602126569_6517147444119145625_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=Ii1U0o2K48IAX-R0JV7&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT8EGtPn6ahcoTtiUMDWNcIN8iIgSqB0PJ0WOYzelbz2Ag&oe=62BD53EF", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/220108098_3181760505384543_8543935997483108961_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=DptkU83icF0AX9WhxrC&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9gTRcjzlWC6L9H0xUf6zUy4KcvY6mUdcKnvgchUD6yVw&oe=62BD419E", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/218729414_117181627290964_3357336276194453361_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=N_b6bBzgDFQAX_0ya8j&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9PzDLXdqUDA08zUqE2PptJ68wWMvsHrn-sJY41OoSBzQ&oe=62BBD742", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/217594408_4121896471237021_2783602358174919608_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=6QcncLsbeH4AX90dHU9&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT9AsRdHVKALm55q5C2AdWdzP_t--LiSfrVnXn1QIJFbhA&oe=62BCA446", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/217507788_1411739375879281_2771058208014447036_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=zIBJ7tgY3hcAX_CrIsX&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT-UZa-dDqVDi-61Vb5l-8Y1c9H0Hia-2uZ9s_Fff3nS1w&oe=62BB8668", "https://scontent.fdel10-1.fna.fbcdn.net/v/t39.30808-6/216725721_1065288980669590_236320812694604130_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=36a2c1&_nc_ohc=vzJBuC9LsC4AX9uZ1OW&_nc_ht=scontent.fdel10-1.fna&edm=ADI6gjAEAAAA&oh=00_AT_x4Vra4AwOeMihV4RK5nynGaF9HhDyzQAufVG66LNH8A&oe=62BC4A36"]}